{
  "intents":[
      {
          "tag": "Pembuka",
          "patterns": [
              "assalamualaikum",
              "Assalamualaikum",
              "hallo",
              "good morning",
              "hai",
              "bro",
              "sis",
              "ustazt"
          ],
          "responses": [
              "waalaikumsalam",
              "Waalaikumsalam di sini islamic bot, ada yang bisa saya bantu"
          ]
      },
      {
          "tag": "goodbye",
          "patterns":[
              "waasalamualaikum",
              "Bye",
              "dadah",
              "waasalamualaikum warohmatullahi wabarokatuh",
              "goodbye"
          ],
          "responses":[
              "waasalamualaikum warohmatullahi wabarokatuh"
          ]
      },
      {
          "tag": "pengertian ilmu waris",
          "patterns": [
            "apa itu warisan?",
            "apa itu Faraidh?",
            "Menurut istilah syar'i, apa definisi lengkap dari Ilmu Fara'idh?",
            "Sebutkan tiga bahasan utama yang tercakup dalam ruang lingkup Ilmu Fara'idh menurut istilah syar'i!",
            "Ilmu Fara'idh membahas tentang siapa saja yang berhak mendapatkan warisan?",
            "Apa arti dari kata fariidhah?",
            ""
          ],
          "responses": [
             "Dalam istilah ilmu syari’at ilmu waris ini biasa disebut dengan nama “Ilmu Fara`idh”. Ilmu berarti pengetahuan. Sedangkan Al Fara`idh adalah bentuk jamak dari fariidhah yang berarti bagian tertentu. Menurut istilah syar’i ilmu fara`idh adalah suatu cabang ilmu syariat yang membahas tentang cara pembagian harta warisan, yang meliputi siapa saja yang berhak mendapatkan warisan, yang tidak berhak, serta berapa jumlah yang didapatkan. Selain itu ilmu ini juga sering dinamakan ilmu mawarits, atau fiqh al mawarits. Dalam bahasa Indonesia ia kemudian lebih dikenal dengan istilah ilmu waris atau ilmu pembagian pusaka."
          ]
      },
      {
          "tag": "pentingnya ilmu waris",
          "patterns": [
            "seberapa penting ilmu waris di agama islam?",
            "sebutkan tga ayat dalam Al quran yang merinci tentang pembagian watisan",
            "siapakah yang membicarakan perincian dasar warisan secara langsung dalam al quran",
            "bagaimana kedudukan ilmu waris dalam pandangan islam",
            "apa bukti masalah pembagian warisan dianggap sangat penting dalam islam?",
            "ada berapa total ayat yang merinci pembagian warisan?",
            "dalam surah apa warisan ini di jelaskan?"
          ],
          "responses": [
             "Ilmu ini mempunyai kedudukan tersendiri dalam Islam. Saking pentingnya Allah SWT sendiri yang membicarakan perincian dasar warisan dalam Al Quran. Ada tiga ayat dalam Al Quran yang merinci pembagian warisan, yaitu, ayat 11, 12 dan 176 surah An Nisaa`.\n\nAllah berfirman:\n\n “Allah mensyariatkan (mewajibkan) kepadamu tentang (pembagian warisan untuk) anakanakmu, (yaitu) bagian seorang anak laki-laki sama dengan bagian dua orang anak perempuan. Dan jika anak itu semuanya perempuan yang jumlahnya lebih dari dua, maka bagian mereka dua pertiga dari harta yang ditinggalkan. Jika dia (anak perempuan) itu seorang saja, maka dia memperoleh setengah (harta yang ditinggalkan). Dan untuk kedua ibu-bapak, bagian masing-masing seperenam dari harta yang ditinggalkan, jika dia (yang meninggal) mempunyai anak. Jika dia (yang meninggal) tidak mempunyai anak dan dia diwarisi oleh kedua ibu-bapaknya (saja), maka ibunya mendapat sepertiga. Jika dia (yang meninggal) mempunyai beberapa saudara, maka ibunya mendapat seperenam. (Pembagian-pembagian tersebut di atas) setelah (dipenuhi) wasiat yang dibuatnya atau (dan setelah dibayar) hutangnya. (Tentang) orang tuamu dan anak-anakmu, kamu tidak mengetahui siapa di antara mereka yang lebih banyak manfaatnya bagimu. Ini adalahketetapan Allah. Sungguh, Allah Maha Mengetahui, Mahabijaksana.” QS. An Nisa:11 \n\n Allah berfirman dalam ayat selanjutnya: \n\n “Dan bagianmu (suami-suami) adalah seperdua dari harta yang ditinggalkan oleh istriistrimu, jika mereka tidak mempunyai anak. Jika mereka (istri-istrimu) itu mempunyai anak, maka kamu mendapat seperempat dari harta yang ditinggalkannya setelah (dipenuhi) wasiat yang mereka buat atau (dan setelah dibayar) hutangnya. Para istri memperoleh seperempat harta yang kamu tinggalkan jika kamu tidak mempunyai anak. Jika kamu mempunyai anak, maka para istri memperoleh seperdelapan dari harta yang kamu tinggalkan (setelah dipenuhi) wasiat yang kamu buat atau (dan setelah dibayar) hutang-hutangmu. Jika seseorang meninggal, baik laki-laki maupun perempuan yang tidak meninggalkan ayah dan tidak meninggalkan anak, tetapi mempunyai seorang saudara laki-laki (seibu) atau seorang saudara perempuan (seibu), maka bagi masingmasing dari kedua jenis saudara itu seperenam harta. Tetapi jika saudara-saudara seibu itu lebih dari seorang, maka mereka bersama-sama dalam bagian yang sepertiga itu, setelah (dipenuhi wasiat) yang dibuatnya atau (dan setelah dibayar) hutangnya dengan tidak menyusahkan (kepada ahli waris). Demikianlah ketentuan Allah. Allah Maha Mengetahui, Maha Penyantun.” QS. An Nisa:12 \n\n Allah juga berfirman pada surat An Nisa ayat 176:\n\n Mereka meminta fatwa kepadamu (tentang kalalah). Katakanlah, “Allah memberi fatwa kepadamu tentang kalalah (yaitu), jika seseorang mati dan dia tidak mempunyai anak tetapi mempunyai saudara perempuan, maka bagiannya (saudara perempuannya itu) seperdua dari harta yang ditinggalkannya, dan saudaranya yang laki-laki mewarisi (seluruh harta saudara perempuan), jika dia tidak mempunyai anak. Tetapi jika saudara perempuan itu dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan. Dan jika mereka (ahli waris itu terdiri dari) saudara-saudara laki-laki dan perempuan, maka bagian seorang saudara laki-laki sama dengan bagian dua saudara perempuan. Allah menerangkan (hukum ini) kepadamu, agar kamu tidak sesat. Allah Maha Mengetahui segala sesuatu. QS. An Nisa:176"
          ]
      },
      {
          "tag": "rukun waris",
          "patterns": [
            "apa saja rukun waris?",
            "kapan waktu yang tepat untuk membahas ruku warisan dibandingkan dengan pembahasan lainnya?",
            "apa saja 3 hal yang baru boleh dibicarakan setelah semya rukun warisan terpenuhi?",
            "mengapa pembahasan rukun dianggap sebagai hal yang paling prioritas?",
            "sebutkan secara lengkap tiga rukun dalam pembagian warisan?",
            "apa istilah yang digunakan untuk menyebut pihak yang meninggal dunia dan meinggalkan harta?",
            "siapakah yang dimaksud dengan muwarrits?"
          ],
          "responses": [
             "Yang dimaksud rukun di sini adalah komponen yang harus ada dalam acara pembagian warisan. Ini adalah hal pertama yang harus dibahas terlebih dahulu sebelum menentukan yang lain. Bila rukun-rukun ini sudah ada semua barulah kita membicarakan syarat, sebab dan penghalang mendapatkan warisan. \n\nRukun-rukun tersebut adalah:\n1. Muwarrits (Yang mewariskan); yaitu si mati yang meninggalkan warisan \n2. Warits (Pewaris); yaitu ahli warits yang akan menerima warisan \n3. Al Mawruuts atau Tarikah (warisan); yaitu harta yang ditinggalkan \nBila ketiga komponen ini sudah ada barulah dibicarakan hal-hal berikutnya."
          ]
      },
      {
          "tag": "syarat-syarat waris",
          "patterns": [
            "apakah terpenuhnya semua rukun waris menjamin warisan bisa langsung dilaksanakan",
            "apa yang harus dipenuhi agar hukum waris dapat dilaksanakan meskipun rukun rukunnya sudah lengkap?",
            "bagaimana syarat kondisi ahli waris pada saa muwarrtis meninggal dunia?",
            "apa saja syarat yang harus dipenuhi juka rukun rukun sudah di jalankan"
          ],
          "responses": [
             "Meski rukun-rukun waris sudah terpenuhi, namun ia belum bisa dilaksanakan bila ada syarat yang kurang. Syarat-syarat tersebut adalah: \n1. Pewaris dipastikan masih hidup ketika muwarrits meninggal dunia. Artinya, bila tidak diketahui mana yang lebih dulu meninggal, maka warisan tak dapat diberikan kepada si pewaris yang bersangkutan. \n2. Kematian si muwarrits. Bila muwarrits belum dipastikan mati, atau belum dihukum mati oleh hakim berwenang, berati harta peninggalannya belum bisa dibagikan. Misalnya orang yang hilang bertahun-tahun, dan ini akan dibahas pada bab orang yang hilang insya Allah. \n3. Kejelasan sisi hubungan antara muwarrits dengan warits, dari segi kedekatan,kekuatan dan arah."
          ]
      },
      {
          "tag": "penyebab mendapatkan warisan",
          "patterns": [
            "mengapa seseorang bisa mendapatkan warisan?",
            "hubungan seperti apa jika seseorang mendapatkan warisan dari seorang muwarrits?",
            "apa saja bentuk hubungan yang telah di tetapkan syari'at islam?",
            "apa saja penyebab mendapatkan warisan?"
          ],
          "responses": [
             "yang dimaksud sebab di sini adalah alasan mengapa seorang dinyatakan pantas mendapatkan hak warisan dari muwarrits. Hal ini hanya bisa ditentukan oleh ketetapan syara’ dan tidak bisa dengan ijtihad yang baru. Seseorang berhak mendapatkan warisan bila ia mempunyai hubungan tertentu dengan muwarrits. Bentuk-bentuk hubungan yang telah ditetapkan syari’at untuk mendapatkan warisan adalah: \n1. Keturunan (nasab). Artinya, seorang berhak mendapatkan warisan karena ia mempunyai hubungan nasab dengan muwarrits.\n2. Pernikahan. Suami atau istri mendapatkan warisan karena hubungan pernikahan dengan muwarrits. \n3. Wala`, yaitu bila yang bersangkutan membebaskan si muwarrits dari perbudakan atau dibebaskan oleh muwarrits. \n 4. Kepentingan Islam. Seorang muslim yang meninggal dan tak meninggalkan seorang ahli wsrispun maka hartanya diambil oleh  pemerintah Islam dan dimasukkan ke baitul mal, dan digunakan demi kepentingan Islam dan muslimin."
          ]
      },
      {
          "tag": "mani'(pelarang) mendapat warisan",
          "patterns": [
            "apa istilah yang digunakan untuk menyebut orang yang terhalang mendapatkan warisan meskipun telah memenuhi syarat?",
            "apakah seseorang yang sudah memenuhi wyarat dan sebab waris sudah pasti berhak menerima harta warisan?",
            "sembutkan 3 faktor utama yang menyebabkan seseoran dilarang mendaparkan warisan meski sudah memenuhi sebab dan syarat",
            "sembutkan 3 faktor utama yang menyebabkan seseoran dilarang mendaparkan warisan meski sudah memenuhi syarat dan sebab"
          ],
          "responses": [
             "Seseorang yang telah memenuhi syarat dan memiliki penyebab mendapat warisan dari muwarrits belum tentu berhak menerima warisan tersebut. Ada beberapa faktor yang menyebabkannya terlarang mendapatkan warisan. Bila salah satu faktor ini ada padanya, maka ia tidak berhak mendapatkan warisan. Orang seperti ini disebut mahrum atau mamnu’ (dilarang). \nFaktor-faktor itu adalah: \n1. Berbeda agama. Seorang muslim tidak mewarisi keluarganya yang non muslim, begitu pula sebaliknya. Termasuk didalamnya bila si pewaris atau muwarrits murtad dari Islam atau dihukum murtad oleh pihak berwenang1.\n2. Pembunuhan. Bila seorang anak membunuh ayahnya, baik langsung maupun tidak, maka ia tidak bisa mendapatkan warisan dari ayahnya itu. \n3. Perbudakan. Seorang budak tidak menerima warisan dari keluarganya dan sebaliknya. "
          ]
      },
      {
          "tag": "ahli waris pria",
          "patterns": [
            "berapa total jumlah golongan ahli warisa dari kalangan pria?",
            "apa saja ahli warisan dari golongan pria?",
            "bagaimana pembagian warisan digolongan pria?"
          ],
          "responses": [
             "Ahli waris pria ada 15 orang, yaitu: \n1. Anak laki-laki\n2. Anak dari anak laki-laki (cucu laki-laki) dan seterusnya ke bawah\n3. Ayah\n4. Kakek dari ayah (ayahnya ayah) dan seterusnya ke atas\n5. Saudara kandung\n6. Saudara seayah\n7. Saudara seibu\n8. Anak laki-laki dari saudara kandung\n9. Anak laki-laki dari saudara seayah\n10. Saudara kandung ayah (selanjutnya disebut paman kandung)\n11. Saudara ayah sebapak (selanjutnya disebut paman sebapak)\n12. Anak paman kandung\n13. Anak paman sebapak\n14. Suami\n15. Mu’tiq (Orang yang memerdekakan)\n Apabila kelima belas orang ini ada semuanya, maka yang berhak mendapatkan warisan hanya tiga diantara mereka, yakni: anak laki-laki, ayah dan suami. Sedangkan yang lainnya mahjub. Pembagiannya adalah sebagai berikut: Ayah 1/6, suami 1/4, dan anak mendapat seluruh sisanya. Artinya bila seorang wanita meninggalkan harta sejumlah 12 juta maka pembagiannya adalah:\nAyah 1/6 x 12.000 000 = 2.000.000\nSuami 1/4 x 12.000.000 = 3.000.000\nAnak mendapat 7.000.000"
          ]
      },
      {
          "tag": "ahli waris wanita",
          "patterns": [
            "berapa total jumlah golongan ahli warisa dari kalangan wanita?",
            "apa saja ahli warisan dari golongan wanita?",
            "bagaimana pembagian warisan digolongan wanita?"
          ],
          "responses": [
             "Jumlah wanita pewaris yang sudah disepakati ada 10 orang:\n1. Anak perempuan.\n2. Cucu perempuan dari anak laki-laki atau anak perempuannya anak laki-laki dari anak laki-laki (cicit) dan seterusnya ke bawah. \n3. Ibu.\n4. Ibunya ibu.\n5. Ibunya ayah.\n6. Saudari kandung.\n7. Saudari seayah.\n8. Saudari seibu.\n9. Istri.\n10. Mu’tiqah\nApabila kesemua ahli waris wanita ini ada tanpa ada ahli waris pria satupun, maka yang mendapatkan warisan hanya 5 orang, yakni: ibu, anak perempuan, anak perempuan dari anak laki-laki, istri dan saudari kandung. Harta yang ditinggalkan: 12 juta. pembagiannya adalah sebagai berikut:\nIbu : 1/6 x 12.000.000 = 2.000.000\nAnak Perempuan : 1/22= 6.000.000.\nAnak perempuan dari anak laki-laki : 1/6 x 12.000.000 = 2.000.000\nIstri : 1/8 = 1.500.000\nSaudari kandung : sisa harta = 500.000.\nJika semua ahli waris wanita dan pria ada, maka yang mendapatkan warisan hanya 5 orang, dan itu ada dua kemungkinan:\nKemungkinan pertama: yang meninggal itu wanita, maka yang mendapatkan warisan adalah: anak laki-laki dan perempuan, ayah, ibu dan suami.Pembagiannya:\nSuami : 1/4\nAyah : 1/6\nIbu : 1/6\nAnak laki-laki dan perempuan mengambil sisa dengan ketentuan bagian anak perempuan hanya setengah bagian anak laki-laki. Contoh perhitungan: Seorang pria meninggal dunia dan meninggalkan harta sejumlah 15.000.000 dengan kelima ahli waris diatas.\nSuami : 1/4 x 15.000.000 = 3.750.000\nIbu : 1/6 x 15.000.000 = 2.500.000\nAyah : 1/6 x 15.000.000 = 2.500.000\nAnak laki-laki dan anak perempuan mendapat sisa harta dengan ketentuan bagian anak laki-laki dua kali lipat bagian anak perempuan yaitu 6.250.000, bagian anak perempuan 2.083.333,3 adalah dan anak laki-laki 4.166.666,6\n\nKemungkinan kedua: bila yang meninggal itu pria maka suami diganti istri, dan istri mendapat 1/8.\nContoh perhitungan\nIstri : 1/8 x 15.000.000 = 1.875.000\nIbu : 1/6 x 15.000.000 = 2.500.000\nAyah : 1/6 x 15.000.000 = 2.500.000\nAnak laki-laki dan anak perempuan mendapat sisa harta dengan ketentuan bagian anak laki-laki dua kali lipat bagian anak perempuan yaitu 8.125.000, bagian anak perempuan adalah 2.708.333 dan anak laki-laki 5.416.666"
          ]
      },
      {
          "tag": "ashhaab al furudh",
          "patterns": [
            "siapa saja yang bisa di katakan ashhaab al furudh?",
            "bagaimana urutan prioritas pembagian harta warisan jika terdapat ashabul furudh dan ashabah secara bersamaan?",
            "siapa yang di dahulukan dalam menerima warisan ketika kedua jenis ahli waris tersebut ada?",
            "bagaimana ketentuan pembagian warisan agar sesuai dengan hak masing masing golongan?"
          ],
          "responses": [
             "Di antara ahli waris ada yang memiliki bagian tertentu dari harta warisan yang ditinggalkan dan disebut ashabul furudh, dan ada pula yang bisa memiliki seluruh harta yang disebut ‘ashabah2. Jika keduanya ada, maka warisan itu diberikan dulu kepada ashabul furudh sesuai bagiannya, baru kemudian seluruh sisanya jatuh ke tangan ‘ashabah.\nAshabul furudh adalah:\n1. Ibu.\n2. Nenek.\n3. Ayah.\n4. Ayahnya ayah (kekek).\n5. Anak perempuan.\n6. Cucu perempuan dari anak laki-laki dan seterusnya ke bawah.\n7. Suami.\n8. Istri.\n9. Saudari kandung.\n10. Saudari seayah.\n11. Saudara seibu, baik laki-laki maupun perempuan.\n\n"
          ]
      },
      {
          "tag": "bagian ibu",
          "patterns": [
            "apa saja syarat mutlak yang harus dipenuhi agar seorang ibu berhak mendapatkan bagian warisan?",
            "sebutkan kondisi utama yang menyebabkan hak waris seorang ibu?",
            "kriteria apa saja yang wajib ada pada seorang ibu?",
            "bagaimana status keberadaan anak atau cucu muwarrits agar ibunya bisa memproleh bagian?"
          ],
          "responses": [
             "Bagian Ibu:\na. 1/3; dengan syarat:\n- Muwarrits tidak meninggalkan keturunan, baik anak maupun cucu yang juga ikut mewarisi.\n- Jumlah saudara yang ikut menjadi ahli waris tak lebih dari satu orang atau tak ada sama sekali.\nJika keduanya terpenuhi barulah si ibu mendapatkan 1/3.\nb. 1/6; dengan dua kemungkinan:\n- Muwarrits meninggalkan keturunan, atau\n- Muwarrits meninggalkan lebih dari satu orang saudara, baik pria maupun wanita, sekandung maupun hanya sebapak atau seibu.\nJika salah satu keadaan ini ada, maka ibu mendapatkan 1/6"
          ]
      },
      {
          "tag": "bagian nenek",
          "patterns": [
            "berapa bagian pasti yang diterima oleh nenek, dan bagaimana cara membaginya jika terdapat nenek dari pihak ayah dan ibu sekaligus?",
            "jelaskan mekanisme pembagian harta warisan apabila pewaris meninggalkan lebih dari satu nenek?",
            "apakah jumlah nenek mempengaruhi total besaran harta yang keluar, ataukah harta tersebut dibagi rata diantara mereka?",
            "Siapa pihak utama yang dapat menyebabkan nenek terhalang sehingga tidak mendapatkan harta warisan sama sekali?",
            "Dalam kondisi apa seorang nenek dinyatakan gugur hak warisnya menurut pernyataan di atas?"
          ],
          "responses": [
             "Untuk bagian Nenek:\nBagian nenek adalah seperenam baik ia seorang ataupun banyak, misalnya bila muwariits meninggalkan nenek dari pihak ibu dan nenek dari pihak ayah, maka keduanya mendapatkan seperenam untuk mereka bagi berdua. Syaratnya adalah tidak adanya ibu atau nenek yang lebih dekat darinya ke muwarrits1.\nBila muwarrits meninggalkan ibu maka nenek baik dari pihak ibu maupun ayah terhalang(mahjub)."
          ]
      },
      {
          "tag": "bagian ayah",
          "patterns": [
            "bagaimana rincian pembagian harta waisan untuk seorang ayah berdasarkan keberadaan dan jenis kelamin keturunan si muwariits",
            "kondisi apa saja yang menentukan besaran hak waris ayah?",
            "kapan seorang ayah mendapatkan hak sebagai ashabah?",
            "jelaskan syarat syarat spesifik yang membuat bagian ayah berubah dari sekedar 1/6 menjadi 1/6 ditambah sisa?"
          ],
          "responses": [
             "Untuk Ayah\na. 1/6 dengan syarat:\n- Muwarrits meninggalkan keturunan laki-laki.\nb. 1/6 + sisa, dengan syarat:\n- Muwarrits hanya meninggalkan keturunan perempuan, tapi tidak meninggalkan keturunan laki-laki.\nc. Jika muwarrits tidak meninggalkan keturunan, maka ayah mendapatkan sisa harta(‘ashabah)."
          ]
      },
      {
          "tag": "bagian kakek",
          "patterns": [
            "sebutkan syarat syarat yang dapat di terima oleh kakek dan baiannya?",
            "syarat utama yang berkaitan dengan keberadaan ayah agar kakek berhak menerima warisan?",
            "siapa saja pihak yang harus tidak ada agar hak waris kakek menjadi tidak terhalang?",
            "bagaimana pengaruh jenis kelamin keturunan terhadap perubahan jatah warisan kakek?"
          ],
          "responses": [
             "Untuk bagian Kakek\nKakek yang menjadi ahli waris adalah ayahnya ayah dan seterusnya ke atas. Kakek mendapatkan:\na. 1/6 dengan syarat:\n- Muwarrits tidak meninggalkan ayah, atau kakek yang lebih dekat darinya,\n- tapi meninggalkan keturunan\nb. Mendapat sisa (‘ashabah), dengan syarat:\n- Muwarrits tidak meninggalkan ayah dan keturunan\nc. 1/6 + sisa harta, dengan syarat:\n- muwarrits meninggalkan keturunan perempuan, tapi tak meninggalkan keturunan laki-laki.\n- Tidak meninggalkan ayah, atau kakek yang lebih dekat darinya."
          ]
      },
      {
          "tag": "anak perempuan",
          "patterns": [
            "bagaimana perbedaan ketentuan pembagian warisan antara anak perempuan tunggal dengan anak peremuan yang berjumlah lebih dari satu?",
            "bagaimana skenario pembagian harta bagi anak perempuan berdasarkan jumlah saudarinya?",
            "berapa porsi warisan yang diterima anak perempuan juka ia sendiri dan berapa jika ia berdua atau lebih?",
            "bagamana pembagian warisan jika muwariits mininggalkan tiga anak perempuan tanpa anak laki laki"
          ],
          "responses": [
             "Untuk Pemagian Anak perempuan:\na. 1/2 dengan syarat:\n- Hanya seorang diri (tidak punya saudara)\nb. 2/3 dengan syarat:\n- Tidak ada saudara laki-laki\n- Lebih dari seoran\nArtinya, anak perempuan bila dua orang atau lebih mendapatkan 2/3 harta yang mereka bagi rata."
          ]
      },
      {
          "tag": "pembagian cucu perempuan",
          "patterns": [
            "kondisi apa saja yang menyebabkan perubahan hak waris cucu perempuan, mulai dari mendapatkan bagian maksimal hingga tidak mendapatkan apa apa?",
            "bagaimana pengaruh keberadaan anak kandung mayit terhadap perolehan harta warisan bagi cucu perempuan?",
            "dalam situasi apa seorang perempuan dinyatakan terhalang total dan kapan ia berstatus sebagai penerima sisa?",
            "bagaimana pembagian warisan untuk cucu perempuan?"
          ],
          "responses": [
             "Untuk Pembagian warisan Cucu perempuan (anak perempuannya anak laki-laki):\na. 1/2 dengan syarat:\n Hanya seorang diri.\n- Si muwarrits tidak meninggalkan anak laki-laki yang menjadi hajib (penghalang).\n-Tidak ada saudara laki-laki atau cucu laki-laki muwarrits dari anak laki-lakinya (anak paman) dan ini disebut mu’ashshibnya.\n- Tidak ada anak perempuan muwarrits, (bibinya).\nb. 1/6 dengan syarat:\n- Tidak ada saudara laki-laki, dan anak pamannya (mu’ashshib).\n- Si muwarrits tidak meninggalkan anak laki-laki (paman yang menjadi hajib).\n- Adanya anak perempuan si muwarrits (bibinya) yang hanya seorang diri.\nc. 2/3 dengan syarat:\n- Tidak ada saudara laki-laki atau anak paman yang laki-laki (mu’ashshib)\n- Si muwarrits tidak meninggalkan anak laki-laki dan anak perempuan sekaligus.\n- Jumlahnya lebih dari satu orang, baik bersama saudarinya atau anak perempuan dari anak laki-laki lain bagi si muwarrits (putri pamannya) dan ini disebut musyarik.\n=Jika muwarrits meninggalkan anak laki-laki maka anak perempuan dari anak laki-laki terhalang.\n= Jika muwarrits meninggalkan anak laki-laki dari anak laki-laki, maka si anak perempuan dari anak laki-laki mendapat sisa harta bersama si anak laki-laki dari anak laki-laki tadi (‘ashabah bi ghairihi).\n= Jika muwarrits meninggalkan lebih dari satu orang anak perempuan, maka cucu perempuan dari anak laki-laki tidak mendapatkan apa-apa"
          ]
      },
      {
          "tag": "pembagian warisan suami",
          "patterns": [
            "bagaimana pembagian warisan untuk seorang suami?",
            "bagaimana ketentuan pembagian warisan untuk suami jika dilihat dari keberadaan anak atau cucu muwariits?",
            "bagaimana pengaruh keturunan terhadap jatah warisan yang di terima seorang suami?",
            "jika istri meninggal tanpa meninggalkan anak sama sekali berapa bagian pasti yang di terima olah suaminya?"
          ],
          "responses": [
             "Pembagian Warisan Suami:\na. 1/2 dengan syarat: Si muwarrits tidak meninggalkan keturunan seorangpun, baik laki-laki maupun perempuan, baik dari dirinya maupun suami yang lain.\nb. 1/4 dengan syarat: Muwarrits meninggalkan keturunan. "
          ]
      },
      {
          "tag": "Pembagian Warisan Istri",
          "patterns": [
            "bagaimana pembagian warisan untuk seorang istri?",
            "apa syarat mutlak yang membedakan besaran penerima harta warisan untuk seorang istri?",
            "bagaimana ketentuan pembagian waris untuk istri berdasarkan status keturunan yang ditinggalkan suaminya?",
            "berapa porsi harta yang diterima istri jika diketahui suaminya memiliki keturunan?"
          ],
          "responses": [
             "Pembagian warisan Istri:\na. 1/4 dengan syarat: muwarrits tidak meninggalkan keturunan seorangpun, baik lakilaki maupun perempuan, baik dari dirinya maupun istri yang lain.\nb. 1/8 dengan syarat: muwarrits meninggalkan keturunan. "
          ]
      },
      {
          "tag": "pembagian warisan saudari sekandung",
          "patterns": [
            "bagaimana pembagian warisan untuk saudari kandung?",
            "jelaskan rincian pembagian waris untuk saudari kandung beserta syarat syarat spesifik untuk setiap bagiannya?",
            "apa saja kondisi yang membedakan hak waris saudai kandung antara mendapat setengah, sua pertiga, menjadi ashabah, atau terhalang sama sekali?",
            "sebutkan syarat syarat mutlak yang harus dipenuhi agar saudari kandung berhak menerima bagian?"
          ],
          "responses": [
             "pembagian warisan untuk Saudari kandung:\na. 1/2 dengan syarat:\n- Tidak bersama saudara lelaki sekandung (mu’ashshib)\n- Hanya seorang diri (tak ada saudari perempuan sekandung atau musyarik)\n- Tidak ada hajib (penghalang), yaitu keturunan laki-laki, ayah, dan kakek.\n= Bila muwarrits meninggalkan anak laki-laki maka saudari kandung terhalang.\n= Bila muwarrits meninggalkan anak perempuan tanpa anak laki-laki, maka saudari kandung mendapat sisa harta (‘ashabah ma’al ghair)\n=Bila muwarrits meninggalkan ayah, maka para ulama sepakat bahwa semua saudara mahjub (terhalang). Namun bila meninggalkan kakek dan seterusnya keatas, maka para ulama berbeda pendapat dan akan dijelaskan pada babnya nanti insya Allah.\nb. 2/3 dengan syarat: lebih dari satu orang, selanjutnya sama dengan syarat-syarat diatas."
          ]
      },
      {
          "tag": "pembagian saudari seayah",
          "patterns": [
            "bagaimana pembagian warisan untuk saudari seayah?",
            "apa saja kondisi yang membedakan hak waris saudari seayah antara mendapat setengah, dua pertiga, atau menjadi seperenam??",
            "apa saja syarat tambahan saudari seayah untuk mendapatkan hak warisnya?",
            "Bagaimana pengaruh keberadaan saudari kandung terhadap besaran harta yang diterima oleh saudari seayah?"
          ],
          "responses": [
             "pembagian warisan untuk Saudari seayah:\na. 1/2 dengan syarat sama dengan saudari kandung ditambah tidak adanya saudara kandung muwarrits baik pria maupun wanita, serta tidak adanya mu’ashshib bagi saudarai sebapak, yaitu saudara laki-laki muwarrits sebapak juga.\nb. 2/3 dengan syarat sama dengan diatas yaitu kalau ia bersama saudari si muwarrits sebapak, baik yang sekandung dengan dia atau juga sebapak. Ini dalam ilmu fara’idh disebut musyarik.\nc. 1/6 dengan syarat si muwarrits meninggalkan saudari kandung hanya seorang, tanpa saudara laki-laki"
          ]
      },
      {
          "tag": "pembagian saudara seibu",
          "patterns": [
            "bagaimana pembagian warisan untuk saudara seibu?",
            "bagaimana peredaan besaran warisan yang diterima saudara seibu jika ia hanya seorang diri dibandingkan jika ia berjumlah banyak?",
            "apa faktor utama yang menyebabkan perubahan jatah saudara seibu?",
            "apakah perbedaan jenis kelamin mempengaruhi besaran warisan di kalangan saudara seibu?"
          ],
          "responses": [
             "Pembagian Warisan untuk Saudara seibu:\na. 1/6 dengan syarat:\n- Hanya seorang diri (sama saja baik laki-laki maupun perempuan).\n- Tidak ada hajib.\nb. 1/3 dengan syarat:\n- Lebih dari satu orang baik laki-laki maupun perempuan atau campuran\n- Tidak ada hajib."
          ]
      },
      {
          "tag": "ashabah",
          "patterns": [
            "apa definisi dan prinsip kerja pembagian warisan bagi kelompok ashabah?",
            "kondisi apa saja yang dialami oleh ashabah?",
            "bagaimana mekanisme prioritas pembagian harta ketika ashabah bertemu dengan ashabul furudh?",
            "apa yang terjadi pada jatah ashabah jika warisan telah habis dibagikan kepada ashabul furudh?"
          ],
          "responses": [
             "‘ashabah adalah ahli waris yang tidak ditentukan bagiannya secara khusus, tapi justru mendapatkan seluruh harta warisan bila tak ada ahli waris lain bersamanya, atau mendapatkan keseluruhan sisa harta setelah dibagikan kepada ashhab al furudh. Bagian ‘ashabah adalah:\n- Bila muwarrits hanya meninggalkan ‘ashabah, maka ia mendapatkan semua harta.\nContoh: Seseorang mati meninggalkan 10 orang anak laki-laki, maka harta warisannya dibagikan kepada mereka semua dibagi rata.\n- Bila muwarrits meninggalkan Ashhab al furudh dan ‘ashabah, maka warisan dibagikandulu kepada ashhab al furudh, baru kemudian sisanya diberikan semua kepada ‘ashabah.\nContoh: 10 orang anak di atas bersama ibu dan istri muwarrits, maka hartanya dibagikan dulu kepada ibu yang mendapat 1/6 dan istri yang mendapat 1/8, barulah sisanya dibagi kepada mereka.\n- Bila ternyata setelah dibagikan kepada ashhab al furudh warisannya tak meninggalkan sisa, atau malah berkurang dan terjadi ‘aul, maka ‘ashabah tidak mendapatkan apaapa.\nContoh: Seorang meninggalkan seorang saudari kandung, seorang saudari seayah,ibu, dan seorang saudari seibu, serta seorang paman kandung.\n- Bila terdapat lebih dari satu ‘ashabah, maka sisa harta diberikan kepada yang lebih kuat kedudukannya, dan yang lain mahjub (lihat Bab hajb). Misalnya ada ayah dan paman kandung, maka yang menghabiskan seluruh atau sisa harta adalah ayah, dan paman kandung mahjub."
          ]
      },
      {
          "tag": "jenis jenis ashabah",
          "patterns": [
            "sebutkan jenis penggolongan ahliwaris ashabah dalam ilmu waris",
            "apa saja macam amcam ashabah?",
            "bagaimana pembagian kategori ashabah berdasarkan penyebab statusnya?",
            "jelaskan defenisi singkat dan macam macam ashabah?"
          ],
          "responses": [
             "‘Ashabah ada tiga macam:\n1. ‘ashabah bi nafsihi (‘ashabah dengan sendirinya)\n2. ‘ashabah bi ghairihi (‘ashabah lantaran adanya orang lain)\n3. ‘ashabah ma’al ghair (‘ashabah bersama orang lain)\n\n1.’Ashabah bi nafsihi\nDisebut ‘ashabah bi nafsihi karena ia sedari awal ia memang berstatus ‘ashabah dengan syarat-syarat yang sudah ditentukan. Jumlahnya ada 12:\n1. Anak laki-laki\n2. Cucu laki-laki dari anak laki-laki dan seterusnya ke bawah\n3. Ayah\n4. Kakek dari ayah dan seterusnya ke atas\n5. Saudara laki-laki kandung\n6. Saudara seayah\n7. Anak saudara kandung\n8. Anak saudara seayah\n9. Paman kandung\n10. Paman sebapak\n11. Anak paman kandung\n12. Anak paman sebapak\nJika semuanya ada, maka yang berhak mendapatkan warisan hanya anak dan ayah. Yang lainnya mahjub. Tapi yang menjadi ‘ashabah hanya anak, sedangkan ayah menjadi shahib fardh yaitu mendapat 1/6.\n\n2.’Ashabah bi ghairihi ‘ashabah bi ghairihi adalah ahli waris yang tadinya mendapatkan bagian tertentu (ashhab al furudh), tapi berubah menjadi pengambil sisa semua harta karena ada ahli waris lain yang menariknya menjadi ‘ashabah. Ahli waris yang menarik itu disebut mu’ashshib. Dalam hal ini bagian tertentunya tidak berlaku dan ia hanya berbagi dengan mu’asshibnya.\nBerikut ahli waris yang menjadi ‘ashabah bi ghairihi beserta para mu’ashshibnya:\n-⁕ Anak perempuan mu’ashshibnya anak laki-laki (saudara kandungnya).\n⁕ Cucu perempuan mu’ashshibnya:\n• Cucu laki-laki (baik saudaranya maupun sepupunya).\n• Cicit laki-laki dari cucu laki-laki dari anak laki-laki (keponakannya) bila diperlukan.\n⁕ Saudari kandung mu’ashshibnya saudara kandung.\n⁕ Saudari seayah mu’ashshibnya saudara seayah.\n\n3.’Ashabah ma’al ghair\n‘ashabah ma’al ghair adalah saudari sekandung atau sebapak seorang diri atau lebih. Ia mendapatkan sisa harta atau menjadi ‘ashabah dengan syarat:\na. Tidak ada mu’ashshib\nb. Tidak ada hajib\nc. Bersama anak keturunan perempuan muwarrits\n• Jika salah satu dari syarat ini tidak terpenuhi maka, saudari tidak bisa menjadi‘ashabah ma’al ghair.\n Bila ada mu’ashshib, maka ia menjadi ‘ashabah bi ghairihi.\nContoh: Seorang meninggalkan anak perempuan, ibu, istri, saudara dan saudari kandung."
          ]
      },
      {
          "tag": "Akidah",
          "patterns": [
              "Apa hubungan antara akidah, syariah, dan ibadah",
              "apa hubungan antara akidah, syariah, dan ibadah",
              "Apa Hubungan Antara Akidah, Syariah, dan Ibadah",
              "Hubungan Antara Akidah, Syariah, dan Ibadah",
              "Hubungan antara akidah, syariah, dan ibadah",
              "hubungan antara akidah, syariah, dan ibadah"
          ],
          "responses": [
              "AKIDAH 'saya yakin bahwa Allah selalu melihat saya dimanapun saya berada bahkan ketika kita berada di dalam WC itu namanya akidah. \n\nIBADAH 'apapun ibadahnya adalah buah dari akidah tersebut karena Allah senantiasa melihatku maka akupun melakukan ibadah kepada-nya'\n\nPerpaduan ini di sebut sebagai IHSAN, Seperti ssabda Nabi 'IHSAN adalah engkau beribadah seolah-olah engkau melihat-nya, kalau engkau tidak melihatnya maka dia melihatmu'\n\nSeperti itulah akidah, bahwa kita merasa dipantauoleh Allah SWT., tidak ada satu gerakan pun yang luput dari pantauan-nya. Dia tidak pernah mengantuk dan tidak pernah tidur. Dia selalu bersamamu kemanapun kamu berada\n\nاَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَۚ اَلْحَيُّ الْقَيُّوْمُ ەۚ لَا تَأْخُذُهٗ سِنَةٌ وَّلَا نَوْمٌۗ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖۗ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرْسِيُّهُ السَّمٰوٰتِ وَالْاَرْضَۚ وَلَا يَـُٔوْدُهٗ حِفْظُهُمَاۚ وَهُوَ الْعَلِيُّ الْعَظِيْمُ \n\nArtinya: Allah adalah Tuhan. Tidak ada tuhan selain Allah. Allah mahahidup lagi maha pengatur. Allah tidak tersentuh oleh kantuk dan tidak pula tidur, sehingga tidak pernah lengah. Semua yang ada di langit dan di bumi hanyalah milik Allah. Siapakah yang dapat memberikan pembelaan di sisi Allah tanpa izin-nya? Allah mengetahui semua perbuatan manusia ketika masih hidup serta pengaruh yang di tinggalkan sesudah mereka mati. Manusia sama sekali tidak mengetahui ilmu yang Allah kehendaki diberikan kepadanya. Singgasana Allah luas meliputi semua langit dan bumi. Allah tidak sulit untuk memeliharanya. Allah Mahatinggi kekuasaan-Nya lagi Maha Agung kedudukan-nya. (QS.al-Baqarah:255)."
          ]
      },
      {
          "tag": "Patung",
          "patterns": [
              "apa hukumnya patung untuk celengan atau mainan",
              "Apa hukumnya patung untuk celengan atau mainan",
              "apa hukumnya bermain boneka",
              "apa hukumnya bermain patung",
              "apa hukumnya bermain patung"
          ],
          "responses": [
              "patung untuk anak-anak boleh, yang tampilannya seperti boneka. MAna dalilnya? Dalilnya adalah sikap Nabi SAW yang membiarkan Aisyah Ra. bermain-main boneka. jadi bolehlah Anak-anak main aneka macam boneka\n\nAisyah Radhiallahu'anhu bercerita:\nكُنتُ الْعَبُ بِالبَنَاتِ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَوَكَانَ لي صَواحِبُ يَلْعَبْنَ مَعِي، فَكَانَ رَسُولُ اللَّهُ عَلَى الله عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ يَتَقَمَعْنَ مِنْهُ.فَيُسَرُبُهُنَّ إِلَيَّ فَيَلْعَيَّنَ مَعِي\n\nAku bermain dengan boneka di sisi nabi SAW, saat itu ada kawan-kawanku yang bermain bersamaku, jika Rasulullah SAW masuk mereka bersembunyi, lalu Rasulullah SAW mengambilkannya untukku lalu mereka bermain denganku (HR.Muttafaq'alaih)"
          ]
      },
      {
          "tag":"Jimat",
          "patterns":[
              "Apa yang harus saya lakukan dengan jimat",
              "apa yang harus saya lakukan dengan jimat",
              "apa efek ke kita jika menyimpan jimat",
              "Apa efek ke kita jika menyimpan jimat",
              "Apa kah bole menerima jimat yang di berikan oleh seseorang",
              "apa kah bole menerima jimat yang di berikan oleh seseorang",
              "apa kah bole kita menerima atau mencari jimat",
              "Apa kah bole kita menerima atau mencari jimat"
          ],
          "responses":[
              "Jika kita mendapatkan jimat Bakar saja itu benda. kalau di kasi barang-barang dari dukun, bakar saja. jangan biarkan ada jin di dalam rumah.\n\nAda jin yang menyertai kita semnenjak lahir, namanya Jin Qarin. KAlau kita mati, jin itu tetap Hidup. Ada jin yang berkeliaran di mana-mana, jin yang tidak jelas inilah yang diisikan dari dalam benda-benda oleh dukun, kalau ada benda itu di rumah , buang atau bakar saja.\n\nأَفَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهُ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتٌ رَحْمَتِهِ قُلْ حَسْبِيَ اللهُ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكَّلُونَ\nKatakanlah: 'Maka terangkanlah kepadaku tentang apa yang kamu seru selain Allah, jika Allah hendak mendatangkan kemudaratan kepadaku, apakah berhala-berhalamu itu dapat menghalangkan kemudaratan itu, atau jika Allah hendak rahmat kepadaku, apakah mereka dapat menahan rahmat-nya?' Katakanlah: 'Cukuplah Allah bagiku.' kepada-Nya lah bertawakal orang-orang yang berserah diri.' (QS.az-Zumar:38)\n\nBakar atau buang benda/barang pemberian Dukun/Jimat"
          ]
      },
      {
          "tag": "Bela diri tenaga dalam",
          "patterns":[
              "Bolehkah seorang muslim mengamalkan tenaga dalam?",
              "bolehkah seorang muslim mengamalkan tenaga dalam?",
              "bolehkah seorang umat muslim mengamalkan tenaga dalam?",
              "bolehkah seorang umat muslim mengamalkan tenaga dalam?",
              "Bolehkah seorang muslim mengamalkan tenaga dalam",
              "bolehkah seorang muslim mengamalkan tenaga dalam",
              "bolehkah seorang umat muslim mengamalkan tenaga dalam",
              "bolehkah seorang umat muslim mengamalkan tenaga dalam"
          ],
          "responses":[
              "Jika tenaga dalam yang memakai perantara jin maka tidak boleh. Jika sudagh terlanjur mengamalkan tendaga dalam dengan bantuan jin seperti ini, segera lakukan Ru'yah supaya jin itu keluar dari tubuh\n\nJin itu terbagi menjadi dua\nPertama, Jin Qarin yang menemani setiap manusia dari lahir hingga mati. Tugasnya menganggu manusia yang ia temani tersebut. Saat manusia mati, jin Qarin tidak mati.\nKedua, jin yang berkeliaran di mana-mana. Inilah jin yang di manfaatkan untuk tenagadalam.\n\nقُلِ ادْعُوا الَّذِيْنَ زَعَمْتُمْ مِّنْ دُوْنِهٖ فَلَا يَمْلِكُوْنَ كَشْفَ الضُّرِّ عَنْكُمْ وَلَا تَحْوِيْلًا\nKatakanlah (Muhammad), “Panggillah mereka yang kamu anggap (tuhan) selain Allah, mereka tidak kuasa untuk menghilangkan bahaya darimu dan tidak (pula) mampu mengubahnya.” "
          ]
      },
      {
          "tag": "Syurga",
          "patterns":[
              "apakah manusia sudah ada yang masuk syurga?",
              "Apakah manusia sudah ada yang masuk syurga?",
              "Apakah sudah bisa masuk syurga?",
              "apakah sudah bisa masuk syurga?"
          ],
          "responses":[
              "Nabi Muhammad SAW. duluan yang masuk ke syurga untuk meninjau/melihat-lihat keadaan di surga. Selanjutnyaruh orang-orang saleh, mereka masuk ke dalam paruh burung berwqarna hijau, lalu burung itu terbang kesana-kemari di dalam surga. MEreka dibawa jalan-jalan ke dalam surga, di tunjukkan tempat tempat di surga. jadi mereka hanya dibawa jalan-jalan dulu, belum menempati/menghuni. itulah sebabnya mengapa orang-orang yang mati syahid wajahnya tersenyum, karena sebelum nyawanya keluar, malaikat mengepakkan sayapnya dan memperlihatkan tempat mereka kelak di suyrga.\n\nKemudian jika Anda ingin mempelajari tentang syurga, neraka, dan alam barzah, silahkan membaca 2 kitab rujukan, yaitu At-Tadzirah karya imam al_Qurthubi dan Ar-Ruh karya imam ibnu Qayyim al-jauziyah."
          ]
      },
      {
          "tag": "Membaca yasin untuk orang mati",
          "patterns":[
              "apa hukumnya membaca yasin untuk orang mati",
              "apa hukumnya membaca yasin untuk orang meninggal",
              "apakah sampai kalau kita membacakan yasin kepada orang yang sudah mati"
          ],
          "responses":[
              "Untuk membacakan yaskin kepada orang yang sudah mati doda kita akan sampai, dalilnya adalah kisah Rasulullah SAEW yang menancapkan pelepah daun kurma kepada muslim yang sudah meninggal untuk mertingankan siksa kuburnya. kalau pelepah kurma saja sampai, tentunya bacaan surat yasin dari orang yang beriman juga sampai.\n\nعَنْ ابْنِ عَبَّاسٍ قَالَ مَرَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَبْرَيْنِ فَقَالَ إِنَّهُمَا لَيُعَذِّبَانِ وَمَا يُعَذِّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَكَانَ لَا يَسْتَتِرُ مِنْ الْبَوْلِ وَأَمَّا الْآخَرُ فَكَانَ يَمْشِي بِالنَّمِيمَةِ ثُمَّ أَخَذَ جَرِيدَةً رَطْبَةً فَشَقْهَا نِصْفَيْنِ فَغَرَزَ فِي كُلِّ قَبْرِ وَاحِدَةً قَالُوا يَا رَسُولَ اللهُ لِمَ فَعَلْتَ هَذَا قَالَ لَعَلَّهُ يُخَفِّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا\n\n\"Dari Ibnu Abas Radhiyallahu'anhuma, ia berkata:\n Rasullulah Shallallahu'alaihi wa sallam melewati dua buah kuburan. Lalu beliau bersabda, \"Sesungguhnya keduanya sedang disiksa. Mereka disiksa bukan karena perkara besar (dalam pandangan keduanya). Salah satu dari dua orang ini, (semasa hidupnya) tidak menjaga diri dari kencing. Sedangkan yang satunya lagi dia keliling menebar namaiimah\" kemudian Beliau mengambil pelepah basah. Beliau belah menjadi dua, lalu Beliau tercampakkan di atas masing-masing kubur satu potong. para sahabat bertanya, \"Wahai Rasulullah. Mengapa Rasul melakukan ini?\" Beliau menjawab, \"Semoga mereka di ringankan sikaannya, selama keduanya belum kering\" (HR> Bukhari)\n\nAbdillah bin Umar, Sebelum meninggal beliau berpeesan agar di bacakan suray al-Baqarah ayat 1-5 dan ayat 284-246, agar di bacakan di atas makam. ini memperkuat dalil di atas.\n\nDalam madzhab Syafi'i dikatakan bahwa untuk orang yang sudah meninggal, bacakan untuknya satu al-Qur'an penuh, yakni 30 juz. kalau tidak sanggup, bacakan ummul Qur'an yaitu Al-Fatihah."
          ]
      },
      {
          "tag":"Membaca Al-Qur'an untuk orang mati di kuburan",
          "patterns":[
              "bolehkah membacakan alquran di kurburan",
              "bolehkah membacakan alquran di kurburan untuk orang yang sudah mati",
              "Apakah boleh membacakan alquran di kurburan untuk orang yang sudah mati"
          ],
          "responses":[
              "Boleh, Sesuai Riwayat Berikut ini:\n\nعَنْ أَبي هُرَيْرَةَ أَنَّ رَجُلًا أَسْوَدَ أَوْ امْرَأَةٌ سَوْدَاءَ كَانَ يَقُمُ الْمَسْجِدَ فَمَاتَ فَسَأَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْهُ فَقَالُوا مَاتَ قَالَ أَفَلَا كُنتُمْ أَذَنْتُمُونِي بِهِ دلُونِي عَلَى قَبْرِهِ أَوْ قَالَ قَبْرِهَا فَأَتَى قَبْرَهَا فَصَلَّى عَلَيْهَا (رواه البخاري)\n\n\"Dari Abu Hurairah bahwasanya seorang laki-laki atau seorang perempuan berkulit hitam yang biasanya menyapu masjid me- ninggal dunia. Lalu Nabi saw. bertanya tentangnya, dan para sahabat menjawab bahwa dia telah meninggal. Nabi ber- sabda: Apakah kalian tidak memberi tahuku tentangnya? Tunjukan kuburnya kepadaku.\" Lalu Nabi Muhammad men- datangi kuburnya dan menshalatinya. (HR. Bukhari)\n\nعَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهُ بْنِ عَوْفِ قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسِ رَضِيَ اللَّهُ عَنْهُمَا عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ قَالَ لِيَعْلَمُوا أَنَّهَا سُنَّةً (رواه البخار)\n\nDari Tholhah bin Abdillah ia berkata: \"Aku menshalati jenazah di belakang Ibnu Abbas ra. lalu ia membaca al- Fatihah. Ia berkata, hendaknya mereka tahu bahwa ini adalah sunnah.\" (HR. Bukhari)"
          ]
      },
      {
          "tag": "Aliran Sesat",
          "patterns":[
              "aliran sesat?",
              "ada berapa aliran sesat di indonesia?",
              "berapa aliran sesat di indonesia?",
              "berapa aliran sesat di indonesia?",
              "bagaimana ciri ciri aliran sesat?",
              "ciri ciri aliran sesat?"
          ],
          "responses":[
              "Tidak bisa di hitung, Ciri aliran sesat adalah tidak pakai al-Qur'an, tak pakai sunah, tak pakai ulama madzhab, dan keluar dari ahlus sunah wal jamaah. maka itu sesat.\n\nعَنْ أَن هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: افْتَرَقَ الْيَهُودُ عَلَى إِحْدَى أَوْ تَنَتَيْنِ وَسَبْعِينَ فِرْقَةً، وَتَفَرقَتِ النَّصَارَى عَلى إحْدَى أَوْ لِنتَيْنِ وَسَبْعِينَ فِرْقَةً وَتَفْتَرِقُ أُمَّتِي عَلى ثَلاثٍ وَسَبْعِينَ فِرْقَةً.\n\nDari Abu Hurairah Radhiyallahu anhu, ia berkat Rasulullah Shallallahu wa sallam telah bersabda Koum Yahudi telah terpecah menjadi tujuh puluh satu (71) golongan atau tujuh puluh dua (72) golongan dan kourn Na telah terpecah menjadi tujuh puluh satu (71) atau jh push dud (72) golongan dan ummatku akan terpecah menjadi tujuh puluh tiga (73) golongan (HR. Abu Daud)\n\nAliran sepat di Indonesia banyaknya tidak bisa dihitung. Ciri aliran sesat adalah tidak pakal al-Qur'an tak pakai sunnah tak pakai ulama madzhab dan keluar dari ahlus sunnah wal jamaah Maka itu sepat"
          ]
      },
      {
          "tag": "Agama Baha'i",
          "patterns":[
              "apa itu agama Baha'i?",
              "Apa itu agama Baha'i?",
              "jelaskan apa yang di maksud agama Baha'i?",
              "Jelaskan apa yang di maksud agama Baha'i?",
              "apa itu agama Baha'i",
              "Apa itu agama Baha'i",
              "jelaskan apa yang di maksud agama Baha'i",
              "Jelaskan apa yang di maksud agama Baha'i"
          ],
          "responses":[
              "Dalam buku agama Baha'i  pada halaman 7 ada gambar tersebut tertulis \"Makam sang Bab. Apa dan siapakah Bab itu?\n\n Bab artinya pintu, karena dialah satu-satunya pintu menuju Imam Mahdi. Bab itu adalah gelar Ali bin Muhammad Ridha asy-Syirazi. Ia lahir di Syuraz Iran pada tahun 1819 M. Pada awalnya ia mengaku sebagai bab saja, pintu menuju Imam Mahdi. Pada Fase selanjutnya menyampaikan kepada Allah. Akhirnya ia mengaku Allah bersemanyam di dalam rinya."
          ]
      },
      {
          "tag": "hubungan Baha'i dengan Bab",
          "patterns":[
              "apa hubungan antara Baha'i dengan Bab?",
              "Apa hubungan antara baha'i dengan bab?",
              "Apa hubungan antara baha'i dan bab?",
              "hubungan antara baha'i dan bab?"
          ],
          "responses":[
              "setelah  Ali bin Muhammad Ridha asy-Syirazi yang bergelar Bab Mati, Maka murid-muridnya terpecah menjadi tiga\n\nPertama, Pengikut Bab yang tetap berpegang teguh pada wasiat Ali bin Muhammad Ridha asy-Syirazi.\nKedua, Pengikut Yahya Ali an-Nurial-Mazandarani yang bergelar Subuh Azal.\nKetiga, Pengikut Husain an-Nuri Al Mazandrani yang bergelar Baha'ullah. pengikutnya disebut Baha'i\n\nmereka saling mengkafirkan, Meskipun Yahya Ali an-Nuri al-Mazandarani (Baha'ullah), tapi ia mengkafirkan Baha'ullah dan pengikutnya dengan sabdanya \n\n\"Lawanlah kenyataan dengan terjadi di tengah-tengah kita dengan kekuatan. Tolaklah dosa, Mudah-Mudahan kamu mendapat Rahmat. Sesungguhnya orang-orang yang menjadikan anak lembu sebagai tuhan setelah cahya Allah, mereka itu adalah orang-orang yang musyrik\"\n\n Yahya Ali an-Nuri al-Mazandarani menyamakan Baha'ullah seperti Samiri yang telah menyesatkan Bani Israil dengan membuat patung anak lembu."
          ]
      },
       {
          "tag":"Apa itu Baha'i",
          "patterns":[
              "apa itu baha'i?",
              "Apa itu Baha'i?",
              "Apa Baha'i itu?",
              "apa baha'i itu?",
              "apa baha'i itu?",
              "jelaskan baha'i itu apa?",
              "Jelaskan Baha'i itu apa?"
          ],
          "responses":[
              "Baha'i adalah agama menyimpang yang di dirikan oleh suatu kelompok di iran. Kelom,pok tersebut ini membuat kitab kitab suci pengganti al-Qur'an, mereka sebut dengan al-Bayan. Satu lagi kitab yang mereka sebut al-Aqdas. mereka meyakini bahwa al-Bayan dan al Aqdas lebih utama dari al-Qur'an. Al-Bayan dan al-Aqdas telah menghapus al-Qur'an"
          ]
      },
      {
          "tag":"Istana Baha'i",
          "patterns":[
              "mengapa istana Baha'i bisa ada di israel?",
              "Mengapa istana Baha'i bisa ada di israel?",
              "Dimana istana Baha'i berada?",
              "dimana istana Baha'i berada?"
          ],
          "responses":[
              "Dua saudara kandung Yahya Ali an-Nuri al-mazandrani yang bergelar Shubh Azal dan Husai an-nur al-mazandrani yang bergelar Baha'ullah dan Baha'ullah pun melakukan percobaan pembunuhan terhadap Shubh Azal. Akhirnya Shubh Azal di asingkan ke Cyprus, sedangkan Baha'ullah di asingkan ke 'Akka Palestina. Shubh Azal mati di Cyprus.\n\nKepemimpinan ia wasiatkan kepada putranya yang akhirnya masuk Kristen, pengikutnya pun terpecah. Sedangkan baha'ullah di Akka lebih beruntung, ia mendapatkan bantuan dari Zionis Israel. mereka membuatkan istana megah untuknya disebut Istana al-Bahjah.\n\nDisanalah Baha'ullah dimakamkan. Kaum Baha'ullah menjadikannya kublat ritual dan berhaji. Terlihat jelas campur tangan asing dalam baha'i"
          ]
      },
      {
          "tag":"Akhir hayat Baha'ullah",
          "patterns":[
              "bagaimana akhir hayat baha'ullah",
              "Bagaimana akhir hayat baha'ullah",
              "Bagaimana akhir hayat baha'ullah?",
              "bagaimana akhir hayat baha'ullah?",
              "bagaimana kematian baha'ullah?",
              "Bagaimana kematian baha'ullah?",
              "Bagaimana wafat baha'ullah?",
              "bagaimana wafat baha'ullah?"
          ],
          "responses":[
              "DI akhir hayatnya, Allah menjadikan sebagai pelajaran, ia tertimpa penyakit gila. ia menutup wajahnya dengan kain seperti wanita, agar para pengikutnya tidak bisa melihatnya, hingga membuat anak tertuanya bernama Abbas Affandi Abdul Baha' mengurungnya agar tidak di lihat orang banyak karena ia dalam kondisi gila. Akhirmnya ia menderita demam panas di seluruh tubuhnya. Sampai akhirnya, setelah penderitaan panjang itu Allah membinasakannya pada bulan mei 1892 M."
          ]
      },
      {
          "tag":"setelah kematian baha'i",
          "patterns":[
              "bagaimana perkembangan baha'i setelah kematian baha'ullah?",
              "bagaimana perkembangan baha'i setelah kematian baha'ullah",
              "Bagaimana perkembangan baha'i setelah kematian baha'ullah?",
              "apa yang terjadi setelah baha'i meninggal?",
              "Apa yang terjadi setelah baha'i meninggal?",
              "Apa yang terjadi setelah baha'i meninggal",
              "apa yang terjadi setelah baha'i meninggal"
          ],
          "responses":[
              "Selanjutnya kepemimpinan baha'i di pimpin oleh Abbas Affan di Abdul Baha'."
          ]
      },
      {
          "tag":"sikap baha'i kepada israel",
          "patterns":[
              "bagaimana sikap baha'i terhadap penjajahan israel terhadap palestina?",
              "Bagaimana sikap baha'i terhadap penjajahan israel terhadap palestina?",
              "apa tanggapan baha'i dengan penjajahan israel terhadap palestina?",
              "Apa tanggapan baha'i dengan penjajahan israel terhadap palestina?"
          ],
          "responses":[
              "Jelas terlihat dukungan Baha'i terhadap Israel, bida dilihat dalam pidato Abbas Affandi:\n\nPada masa ini pada fase tersebut bangsa israel akan berkumpul di tanah suci, mereka akan menguasai dan memiliki tanah-tanah dan desa-desa. Mereka akan mendiaminya.Secara perlahan-lahan mereka akan terus bertambahhingga seluruh Palestina akan menjadi negeri Israel"
          ]
      },
      {
          "tag":"Akidah Baha'i",
          "patterns":[
              "Bagaimana dengan akidah baha'i?",
              "bagaimana dengan akidah baha'i?",
              "jelaskan dengan akidah baha'i?",
              "Jelaskan dengan akidah baha'i?"
          ],
          "responses":[
              "Mereka menyakini bahwa Tuhan bersemayam di dalam diri para pendiri mereka. ini jelas dalam ucapan Baha'ullah saat mewasiatkan kepemimpinan kepada Abbas Afandi dengan berfirman:\n\nDari Allah Yang Maha Kuasa dan Bijaksana kepada Allah YAng Maha Lembut dan Mengetahui (maksudnya: dari Baha'ullah kepada Abbas Affandi Karena mereka meyakini bahwa Tuhan bersemayam di dalam diri mereka)\n\nDalam kitab suci mereka al-Aqdas disebutkan:\nSiapa yang mengenal aku (Baha'ullah) maka ia tyelah mengenal yang dimaskud Siapa yang menghadap kepadaku maka ia telah menghadap kepada yang di sembah"
          ]
      },
      {
          "tag":"keyakinan Baha'i",
          "patterns":[
              "Baha'i meyakinkan agama apa?",
              "Apa agama Baha'i?",
              "apakah benar Baha'i meyakini semua Agama?"
          ],
          "responses":[
              "Inilah yang membuat mereka bida di terima di semua golongan, karena memberikan pembenaran. Abbas Affandi Abdul Baha' mengajarkan puralisme agama. Ia berkata di dalam al-Khitabat Abd al-Baha' pidatonya Halaman 99:\nKetahuailah bahwa kuasa Tuhan tidak hanya khusus pada kelompok tertentu Anda bisa menjadi seorang Baha'i Kristen. Baha'i Freemanasory, Baha'i Yahudi dan Baha'i Muslim"
          ]
      },
      {
          "tag":"Fatwa ulama tentang Baha'i",
          "patterns":[
              "Bagaimana fatwa ulama tentang baha'i",
              "bagaimana fatwa ulama tentang baha'i",
              "Bagaimana pendapat para ulama dengan Baha'i",
              "Bagaimana pendapat para ulama dengan Baha'i"
          ],
          "responses":[
              "TEKS FATWA Darul Ifta (Lembaga Fatwa) di Al-Azhar Mesir:\n\nBismillah,walhamdulillah, shalawat dan salam kepada Rasulullah SAW., amma ba'du.\nAdapun Baha'i adalah sekelompokmurtad dari agama Islam. Tidak boleh memercayainya. Tidak boleh memberikannya izin pendirian persatuan atau lembaga untuk kelompok ini. Karena kelimpok ini berdiri atas dasar akidah al-hulul (tuhan menempati makhluk/baha'ullah). Menempatkan syariat selain yang di turunkan Allah. Menyatakan kenabian. Bahkan menyatakan diri sebagai tuhan.\n\nDEMIKIAN fatwa majama' al-Buhuts al-islamiiyyah (Lembaga Riset Islam) pada masa Syaikh Jad al-Haq. Masih berlau sampai sekarang.\nSyaikh jad al-Haq Ali Jad al-Haq, Pimpinan Tertinggi (Grand Syaikh) Lembaga Al-Azhar berkata: Al-Babiyah atau Baha'i adalah pemikiran yang menggabungkan antara filsafat dan puralisme agama. Didalamnya tidak ada hal yang dibutuhkan umat Islam untuk memperbaiki umat Islam dan untuk menyatukan umat Islam. Bahkan jelas bahwa Baha'i bekerja untuk Zionis Israel dan penjajah. Baha'i adalah aliran pemikiran dari sekte yang menjadi ujian bagi umat Islam memerangi Islam atas nama agama"
          ]
      },
      {
          "tag":"Pemakaman Baha'i",
          "patterns":[
              "Apakah kita boleh memakamkan kaum Baha'i di pemakaman muslim",
              "apakah kita boleh memakamkan kaum Baha'i di pemakaman muslim",
              "apakah boleh kita sebagai umat Muslim memakamkan kaum baha'i",
              "Apakah boleh kita sebagai umat Muslim memakamkan kaum baha'i"
          ],
          "responses":[
              "Jika akidah bahai yang megaku sebagai nabi dan ia juga menyatakan hulullah (Allah bersemayam dalam dirinya) maka tidak di ragukan lagi bahwa mereka itu kafir. Mereka Tidak boleh di kuburkan di pemakaman kaum muslimin. karena siapa yang menyatakan kenabian setelah Nabi Muhammad SAW, maka dia adalah pendusta dan kafir berdasarkan nash dan ijma' kaum muslimin. karena perbuatan itu telah mendustakan firman Allah SWT\n\nمَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلكِنْ رَسُولَ الله وَخَاتَمَ النَّبِيِّينَ وَكَانَ اللهُ بِكُلِّ شَيْءٍ عَلِيمًا\n\n\"Muhammad itu sekali-kali bukanlah bapak dari seorang laki- laki di antara kamu, tetapi dia adalah Rasulullah dan penutup nabi-nabi. Dan adalah Allah Maha Mengetahui segala se- suatu.\" (QS.al-Ahzab [33]: 40)\n\nJuga telah mengingkari hadis-hadis Muw=tawir dari Rasullulah SAW. Bahwa nabi Muhammad SAW. Adalah penutup para nabi. Tidak ada nabi lagi setelah Nabi Muhammad SAW. Demikianlah, maka siapa yang menyatakan diri bahwa Allah SWT. telah bersemayam dalam dirinya, atau pada salah satu dari makhluk-Nya, maka ia telah kafir berdasarkan Ijma' kaum muslimin, karena Allah SWT. tidak berdiam di dalam salah satu makhluk-Nya Allah SWT. Maha Agung dan Mulia dari sifat itu. Siapa yuang menyatakan demikian, maka ia kafir berdasarkan Ijma' kaum muslimin"
          ]
      },
      {
          "tag":"Syi'ah kafir?",
          "patterns":[
              "Siapa yang di kafirkan dengan syi'ah?",
              "siapa yang di kafirkan denagn syi'ah?",
              "Ulama siapa saja yang mengkafirkan syi'ah",
              "ulama siapa saja yang mengkafirkan syi'ah"

          ],
          "responses":[
              "Pemndapat Imam Malik Al-Khallal meriwayatkan dari Abu Bakar al-marwazi, ia berkata, \"Saya mendengar Abu Abdillah berkata, ia berkata, imam Malik berkata: 'Orang yang mencaci maki sahabat Nabi mereka tidak punya bagian dalam islam (Kafir)\""
          ]
      },
      {
          "tag":"Syi'ah di indonesia",
          "patterns":[
              "Apakah syi'ah Kafir",
              "apakah syi'ah Kafir",
              "kenapa orang syi'ah di sebut dengan kafir",
              "Kenapa orang syi'ah di sebut dengan kafir",
              "kenapa syi'ah disebut dengan orang kafir",
              "Kenapa syi'ah disebut dengan orang kafir"
          ],
          "responses":[
              "Ya, karena mereka mencaci maki sabahat.\n\nأَخْبَرَنَا أَبُو بَكْرِ الْمَرُوذِي، قَالَ: سَأَلْتُ أَبَا عَبْدِ اللَّهُ: عَنْ مَنْ يَشْتِمُ أَبَا بَكْرٍ وَعُمَرَ وَعَائِشَةَ؟ قَالَ: مَا أَرَاهُ عَلَى الإِسْلامِ قَالَ: وَسَمِعْتُ أَبَا عَبْدِ اللَّهُ يَقُولُ: قَالَ مَالِكٌ : الَّذِي يَشْتِمُ أَصْحَابَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لَهُ سَهُمْ، أَوْ قَالَ: نَصِيبٌ في الإسلام\n\nArtinya:\nTelah mengabarkan kepada kami Abu Bakar Al-Marwadziy, ia berkata: \"Aku bertanya kepada Abu 'Abdillah tentang orang yang mencaci-maki Abu Bakar, 'Umar, dan 'Aisyah. Maka ia menjawab: 'Aku tidak berpendapat ia di atas agama Islam.\" Al-Marwadziy berkata: \"Dan aku juga mendengar Abu 'Ab- dillah berkata:'Telah berkata Maalik (bin Anas): 'Orang yang mencaci-maki para sahabat Nabi shallallaahu 'alaihi wa sallam, maka ia tidak mempunyai bagian (dalam Islam)' - atau ia berkata: 'bagian dalam Islam.\" (Diriwayatkan oleh Al-Khallaal dalam as-Sunnah no. 783; shahih sampai Ahmad bin Hanbal)"
          ]
      },
      {
          "tag":"bukti",
          "patterns":[
              "Apa buktinya",
              "siapa saja yang di fitnah dengan syi'ah",
              "Siapa saja yang di fitnah dengan syi'ah",
              "Ulama siapa saja yang di fitnah dengan syi'ah",
              "Ulama siapa saja yang di fitnah dengan syi'ah"
          ],
          "responses":[
              "Fakta. mereka menyatakan:\n1. Abu Bakar munafik.\n2. Usman Arogan\n3. Utsman hedonis\n4. Abu Bakar dan Umar adalah Iblis\n Unggkapan ini ada dalam buku \"Kecuali Ali\" penerbit al-Huda, Jakarta. Cetakan Pertama: Juli 2009.\n\nMereka juga menyatakan\n1. Aisyah biang fitnah\n2. Aisyah licik dan pembohong\n3. Abu Hurairah pemalsu Hadis\n4. Abu Hurairah Yahudi yang pura-pura masuk Islam\n ini ada dalam buku \"Antologi Islam,\" penerbit al-huda, Jakarta. Cetakan pertama januari 2005\n\nHadis Nabi SAW. menyatakan\nعَنْ عَلِيٌّ رَضِيَ اللهُ عَنْهُ أَنْ يَهُودِيَّةٌ كَانَتْ تَشْتُمُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَتَقَعُ فيه ، فَخَنَقَهَا رَجُلٌ حَتَّى مانَتْ ، فَأَبْطَلَ رَسُولُ الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَمَهَا\nArtinya:\n\"Dari Ali radhiyallahu 'anhu bahwa salah seorang wanita yahudi mencela menghina Nabi shallallahu 'alaihi wa sallam Kemudian ada salah seorang yang mencekik wanita itu sampai mati, dan Nabi shallallahu 'alaihi wa sallam tidak menuntut darahnya (artinya tidak diqishah).\" (HR. Abu Daud, no: 4362)"
          ]
      },
      {
          "tag":"iman kepada malaikat",
          "patterns":[
              "apa benar malaikat jibril bersayap",
              "Apa benar malaikat jibril bersayap",
              "Apakah malaikat jibril bersayap",
              "apakah malaikat jibril bersayap"
          ],
          "responses":[
              "Dalam Surat fathir Ayat 1 disebutkan:\nالْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةِ مَثْنَى وَثُلَاثَ وَرُبَاعَ يَزِيدُ فِي الْخَلْقِ مَا يَشَاءُ ۚ إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n\"Segala puji bagi Allah Pencipta langit dan bumi, yang menjadikan malaikat sebagal utusan-utusan (untuk mengurus berbagai macam urusan) yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat. Allah menambahkan pada ciptaan-Nya apa yang dikehendaki-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" (QS. Fathir [35]: 1)\n\nDALAM HADIS SAHIH YANG TERDAPAT DALAM KITAB SHAHIH AL-BUKHARI DAN MUSLIM DISEBUTKAN:\nAbu an-Nu'man menceritakan kepada kami, Abdul Wahid menceritakan kepada kami, asy-Syaibani menceritakan kepada kami, ia berkata, \"Saya mendengar Zirrmeriwayatkan dari Abdullah bin Mas'ud, tentang firman Allah:\n\nفَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى فَأَوْحَىٰ إِلَىٰ عَبْدِهِ مَا أَوْحَى\n\n\"Maka jadilah dia (Jibril) dekat (pada Muhammad sejarak) dua ujung busur panah atau lebih dekat (lagi). Lalu dia (Jibril) me- nyampaikan kepada hamba-Nya (Muhammad) apa yang telah Allah wahyukan (QS. an-Najm [53]:9-10)\n\nDEMIKIANLAH yang disebutkan dalam al-Qur'an dan hadis sahih. Kita hanya di- tuntut untuk mengimani isi al-Qur'an dan sunnah, tanpa membayangkan, menggambarkan, apalagi membuat patung seperti yang dibuat-buat oleh orang-orang kafir. Wallahu a'lam bi ash-shawab."
          ]
      },
      { 
          "tag":"jantung malaikat",
          "patterns":[
              "apakah malaikat memiliki detak jantung",
              "Apakah malaikat memiliki detak jantung",
              "Apakah malaikat memiliki denyut nadi",
              "Apakah malaikat memiliki organ tubuh"
          ],
          "responses":[
              "DALAM QUR'AN cuma disebutkan begitu, (Para malaikat) yang mempunyai sayap, masing-masing (ada yang) dua, tiga, dan empat (QS. Fathir ayat 1). Sayap malaikat itu, jika satu di letakkan di ujung timur dan satu lagi di ujung barat maka teng- gelam bumi ini. Makanya Malaikat Jibril sewaktu muncul di bumi ini bukan dalam bentuk aslinya karena bumi ini tak muat menampung kehadirannya.\nRasulullah saw. melihat bentuk asli Jibril saat di Sidratul Muntaha.\nCuma itu yang bisa saya jawab sesuai keterangan dalam Qur'an."
          ]
      },
      {
          "tag":"jumlah ayat alquran",
          "patterns":[
              "benarkan jumlah ayat dalam al-Qur'an ada 6.666 ayat",
              "Benarkan jumlah ayat dalam al-Qur'an ada 6.666 ayat",
              "berapa jumlah ayat al-qur'an",
              "Berapa jumlah ayat al-qur'an"
          ],
          "responses":[
              "Ada beberapa pendapat tentang jumlah ayat al-Qur'an, yakni:\n6.204 ayat\n6.214 ayat\n6.219 ayat\n6.225 ayat\n6.226 ayat\n6.236 ayat\n\nDemikian disebut dalam Kitab Al-burhan fi 'Ulum al-Qur'an karya imam Badruddin Muhammad bin Abdillah az-zarkasyi, juz.1 hal2.49, Kitab Al-itaqan fi ulum al-Qur'an karya Jalaluddin as-Suyuthi juz.1, hal79, dan kitab manahil al-Irfan karya Muhammad bin 'Abd al-'Azhim az-zaqani, juz.1, hal.237."
          ]
      },
      {
          "tag":"Mandi",
          "patterns":[
              "apa hukum nya mandi safar?",
              "apa niat mandi safar?",
              "bagaimana tata cara mandi safar? ",
              "apa kaitan mandi safar dengan islam?"
          ],
          "responses":[
              "Mandi safar adalah bagian dari mandi tobat, orang jika mau bepergian haji dianjurkan bertobat terlebih dahulu, yakni ia harus melakukan shalat tobat, dalilnya, \" Barang siapa melakukan dosa, sebaiknya ia mandi dan bersuci lalu shalat dua rakaat.\" Niatnya adalah ushalli sunnatat tobat rak'ataini lillahi ta'ala, jika ia berangkat haji dan mati di perjalanan maka matinya khusnul khatimah, secara medis mandi safar itu bagus. sebelum bepergian, kita mandi dulu, jadi badan menjadi segar. badan juga refresh. makanya Rasullah saw melarang orang baru saja makan bawang merah atau bawang putih masuk ke masjid, karena malaikat terganggu dengan bau busuk dari mulutnya.\n\nعَنْ جَابِرِ بْنِ عَبْدِ اللهُ قَالَ (وَفِي رِوَايَةِ حَرْمَلَةَ وَزَعَمَ) أَنْ رَسُولَ اللَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ \"مَنْ أَكَلَ ثُوماً أَوْ بَصَلاً فَلْيَعْتَزِلْنَا أَوْ لِيَعْتَزِلْ مَسْجِدَنَا، وَلْيَقْعُدْ فِي بَيْتِه\". وَأَنْهُ أُتِيَ بِقَدْرٍ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ، فَوَجَدَ لَها ريحاً، فَسَأَلَ فَأَخْبِرْ بِمَا فِيهَا مِنَ الْبُقُولِ. فَقَالَ: \"قَرْبُوهَا\" إِلَى بَعْضِ أَصْحَابِهِ. فَلَمّا رَآهُ كَرِهَ أَكْلَهَا، قَالَ : كُل فَإِنِّي أُنَاجِي مَنْ لا تُنَاجِي\". (رواه مسلم)\"Artinya : Dari jabir bin abdullah, ia berkata (didalam riwayat ,yang disampaikan Harmalah, bahwasannya Rasulllah saw. bersabda,\"Barang siapa yang memakan bawang putih atau bawang merah, maka hendaklah ia meninggalkan masjid kami dan hendaklah ia duduk dirumahnya.\" Sesungguhnya beliau disuguhi panci berisi birji-bijian apa itu. Lantas beliau bersabda,\"Dekatkanlah kemari\" -beliau mengatakannya kepada sebagiana para sahabat yang bersama nya, -tatkala melihatnya, beliau tidak suka memakannya seraya bersabda, \"Makan saja, sesungguhnya aku sedang bermunajat kepada yang tidak kalian munajati. \"(HR.MUSLIM)."
          ]
      },
      {
          "tag":"Wudhu",
          "patterns":[
              "apakah sah berwudhu dengan air yang isinya sedikit?",
              "Apakah sah berwudhu dengan air yang isinya sedikit?",
              "apakah sah berwudhu dengan air yang isinya sedikit",
              "Apakah sah berwudhu dengan air yang isinya sedikit",
              "Apakah dengan air sedikit sah untuk berwudu?",
              "Apakah dengan air sedikit sah untuk berwudu",
              "apakah dengan air sedikit sah untuk berwudu?",
              "apakah dengan air sedikit sah untuk berwudu"
          ],
          "responses":[
              "Ini ada air mineral dalam botol ,600 mili liter. saya berwudhu dengan air segini, apakah sah? sah. karena air yang sah untuk berwudhu syaratnya ada 3, tidak berubah warna, rasa, dan bau nya, jika air ini sudah menjadi air soda misalnya, menjadi tidak sah. Airnya tetap suci tapi tidak bisa menyucikan. air yang bisa dipakai untuk berwudhu adalah air yang suci dan menyucikan, disebut 'air mutlaq."
          ]
      },
      {
          "tag":"Puasa",
          "patterns":[
              "bagaimana saat malam bulan puasa berhubungan suami istri, apakah puasa nya sah?",
              "berapa menit jarak antara berbuka dengan adzan?",
              "bolehkan makan setelah isya?",
              "apakah batal puasa nya jika mencicipi gulai sekedar mencicipi?"
              
          ],
          "responses":[
              "puasa nya sah, jika sudah berniat puasa sebelum adzan subuh. kalau sebelumnya tidak berniat puasa maka puasa nya tidak sah.\n begitu berbuka ya saat itula adzan. segala sesuatu yang membatalkan puasa dari terbit fajar sampai tenggelam nya matahari, bagi muadzin minum dulu sekedarnya lalu beradzan.\nboleh saja, yang terpenting saat masuk adzan magrib batalkan dulu puasa nya.\nMazhab hambali mengatakan tidak batal, karena hanya masuk ke ujung lidah dan tidak masuk ke perut."
          ]
      },
      {
          "tag":"Zakat infaq dan Sedekah",
          "patterns":[
              "berapa persen bagian dari zakat fitrah untuk amil zakat?",
              "apakah zakat fitrah mesti dalam bentuk makanan produk atau boleh dalam bentuk uang?",
              "apakah zakat fitrah hanya untuk fakir miskin saja?",
              "apakah bersedekah atas nama orang yang sudah meninggal dunia, apakah dalilnya ada?"
          ],
          "responses":[
              "tidak pakai persen-persenan. sebaiknya dimusyawarahkan dengan tokoh agama setempat dan tokoh masyarakat, yang terpenting jangan sampai bagian amil terlalu banyak atau sedikit.\nMenurut jumhur ulama, zakat fitrah dibayarkan dalam bentuk makanan produk, zakat fitrah ditunaikan dari biji-bijian dan buah-buahan yang dijadikan sebagai makanan pokok, sebanyak satu sha\nZakat fitrah sama dengan pembagian zakat wajib, karena zakat fitrah itu juga adalah zakat, maka pembagiannya sama seperti zakat-zakat yang lainnya, karena zakat fitrah itu adalah zakat, maka masuk dalam ayat(zakat) yang umum.\nBoleh, dalilnya adalah hadis Muhammad bin Abdillah bin al-Mubarak memberitakan kepada kami, ia berkata, Waki'menceritakan kepada kami dari hisyam, dari Qatadah, dari Sa'id bin al-Musayyib, dari Sa'ad bin 'Ubadah, ia berkata, \"Saya berkata kepada Rasulullah saw : 'Sesungguhnya ibu saya telah meninggal dunia, apakah saya(boleh) bersedekah untuknya?' Rasulullah saw. menjawab:'Ya.'Saya katakan kepada Rasulullah saw.:'Sedekah apakah yang lebih afdhal?'Rasulullah saw.menjawab:'Memberi air minum. \"(HR.Ibnu Majah)."
          ]
      },
      {
          "tag":"Haji dan Umrah",
          "patterns":[
              "apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "Apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "Apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "Apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "Apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "apakah hajar aswad sudah ada semenjak Nabi Ibrahim?",
              "apakah hajar aswad sudah ada semenjak Nabi Ibrahim"

          ],
          "responses":[
              "Hajar aswad adalah barang dari surga yang ada dibumi, hadisnya sahih, bahwa hajar aswad atau batu hitam itu dulunya putih. karena dipegang orang-orang yang banyak dosa maka menjadi hitam. ini bukan pendapat ulama, ini adalah hadis yang shahih. kisahnya Nabi adam rindu pada surga, lalu diturunkan batu itu ke bumi."
          ]
      },
      {
          "tag":"Kurban dan Aqidah",
          "patterns":[
              "apakah keutamaan dari berkurban?",
              "bagaimana jika berkurban diatas namakan anak yang baru saja lahir?",
              "apakah sah kurbannya jika saya belum di aqiqahi?",
              "apa yang harus dibaca saat menyembelih hewan kurban?"
          ],
          "responses":[
              "keutamaannya melaksanakan syiar islam, karena menyembelih hewan kurban adalah bagian dari menegaskan syiar Allah dan sebagai bukti dan ungkapan ketakwaan kepada Allah Swt.\nJika saat penyembelihan hewan kurban, anak itu berusia atas 7 hari maka utamakan aqiqah terlebih dahulu, jika saat penyembelihan hewan kurban, anak itu belum berusia 7 hari maka kurban saja, tapi nanti anak tersebut di aqiqahi juga.\nSah, karena itu tanggung jawab orang tua kita dahulu. jadi belom aqiqah jangan dijadikan alasan untuk tidak berkurban.\nإِنَّ صَلاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ,\"Artinya Sesungguhnya shalatku, ibadahku, hidup dan matiku, hanyalah kepunyaan Allah, tuhan semesta alam, yang tiada satupun sekutu bagi-Nya. Dengan semua itulah aku diperintahkan dan aku adalah termasuk orang-orang yang berserah diri(muslim)." 
          ]
      },
      {
          "tag":"Istaqamah dalam ibadah",
          "patterns":[
              "bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "Bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "Bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "Bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "Bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "bagaimana caranya supaya dapat istiqamah shalat dimasjid?",
              "bagaimana caranya supaya dapat istiqamah shalat dimasjid" 
          ],
          "responses":[
              "Begitu terdengar panggilan adzan, langsung bangkit dan pergi ke masjid, karena saat adzan dikumandangkan, setan lari-lari tunggang langgang sampai terkentut kentut. paksalah diri, jadikan ini sebagai kebiasaan, sampai muncul perasaan kalau tak ikut shalat jamaah maka meleleh air matamu."
          ]
      },
      {
          "tag":"Surga",
          "patterns":[
              "sebutkan enam perkara yang jika dikerjakan maka surga balasannya?",
              "Sebutkan enam perkara yang jika dikerjakan maka surga balasannya",
              "sebutkan tiga golongan penghuni surga?",
              "sebutkan tiga golongan penghuni surga"
          ],
          "responses":[
              "Dari 'Ubadah bin ash-Shamit, sesungguhnya Rasullah saw. bersabda,\"Jaminkan e diri kamu enam perkara, maka akan aku jamin masuk surga untuk kamu: Benarlah, jika bicara, penuhi, jika berjanji, tunaikan, jika dalam diberi amanah, jagalah kemaluan, tundukan pandangan, tahanlah perbuatan tangan.\npertama, seseorang yang memiliki kuasa adil, berbagi dan mendapatkan taufiq, kedua, seseorang yang penyayang, memiliki hati yang lembut kepada semua kerabat dan sesama islam, dan ketiga, seseorang yang menjaga kehormatan dirinya, menghindarkan diri dari segala yang syuhbat meskipun ia memiliki tanggungan." 
          ]
      },
      {
          "tag":"Merayakan Ulang Tahun",
          "patterns":[
              "Apa hukum merayakan ulang tahun dalam agama islam?",
              "Bagaimana pandangan Islam terkait Merayakan ulang tahun",
              "Apakah ada dalil-dalil dalam Al-Qur'an atau Hadis yang mengatur tentang merayakan ulang tahun",
              "Bagaimana cara merayakan ulang tahun secara Islami, jika diperbolehkan",
              "Apakah terdapat tradisi Islami yang sering dilakukan dalam perayaan ulang tahun",
              "Apakah ada kegiatan yang perlu dihindari dalam merayakan ulang tahun dalam Islam"
          ],
          "responses":[
              "Dalam hadist yang diriwayatkan oleh imam muslim disebutkan:\nعَنْ أَبِي قَتَادَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُوْلَ اللهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ صَوْمِ يَوْمِ الِاثْنَيْنِ ؟ فَقَالَ ذَلِكَ يَوْمٌ وُلِدْتُ فِيهِ وَيَوْمٌ بُعِثْتُ أَوْ أَنْزَلَ عَلَيَّ فِيهِ\n\nArtinya:\nDari Abu Qatadahra., sesungguhnya Rasulullah saw ditanya tentang puasa senin, amaka beliau menjawab:\"Hari senin adalah hari lahirku, hari aku mulai diutus, atau hari mulai diturunkan wahyu\"(HR.Muslim). Jadi boleh merayakan ulang tahun tapi jangan seperti cara-cara yang tidak benar, seperti memejamkan mata sambil memohon sesuatu untuk masa depan karena itu mirip tradisi kaum Majusi yang menyembah api dan memohon sesuatu pada api. Silahkan merayakan ulang tahun tapi tinggalkan cara-cara seperti itu.\nYang dianjurkan, misalnya datang ke panti asuhan, bawa nasi kotak atau amplop-amplop berisi uang. Bagikan itu kepada anak yatim, lalu berdoa bersama untuk kebaikan. Dan jangan lupa, ulang tahun adalah waktu yang tepat untuk menyadari bahwa umur kita semakin berkurang, berarti makin mendekati kematian. Terus bermuhasabah, mawas diri agar kedepan diri kita lebih baik.  "
          ]
      },
      {
          "tag":"Pacaran",
          "patterns":[
              "Apakah pacaran diperbolehkan dalam agama Islam",
              "Apa hukum pacaran dalam agama islam",
              "Apakah ada dalil-dalil dalam Al-Qur'an atau Hadis yang mengatur tentang pacaran",
              "Bagaimana cara menjalin hubungan yang Islami dengan calon pasangan tanpa pacaran",
              "Apa yang harus dilakukan disaat hati sudah jatuh cinta"
          ],
          "responses":[
              "Wahai, para pemuda dan remaja putri. Coba liat saja botol air mineral. Lihat tutupnya yang tertulis :\"Jangan terima jika segel rusak\". Botol minuman yang seharga lima ribu saja tidak berharga jika segel rusak apalagi kalian. Makanya jaga kehormatan kalian, karena jodoh itu ada di tangan Allah. Kalau masanya sudah datang, pasti kalian akan memiliki pasangan. Jika menemukan wanita yang dicintai, maka datangilah orang tuanya atau walinya untuk dikenalkan secara  ta'aruf. Kalau hati kita di deru rasa rindu, itu karena teringat wajahnya. Kalau begitu tundukkanlah pandanganmu. Setan tidak pernah mengajak manusia untuk langsung zina. Tapi setan mengajaknya secara bertahap, selangkah demi selangkah dalam potongan Surat An-Nur ayat 21 yang artinya:\n..Jangan kau ikuti langkah-langkah setan\n\nDari Maqil Bin Yasar, ia berkata, Rasulullah saw bersabda,\"Ditikamkan ke kepala salah seorang kamu dengan jarum dari besi, itu lebih baik baginya, daripada ia menyentuh perempuan yang tidak halal baginya.\""
          ]
      },
      {
          "tag":"Musik",
          "patterns":[
              "Apakah musik itu haram",
              "Apa hukumnya mendengarkan musik rock metal tapi liriknya islami",
              "Apakah semua jenis musik dianggap haram dalam Islam",
              "Bagaimana hukum mendapat uang dari bermain musik",
              "Apakah ada jenis musik tertentu yang diperbolehkan dalam agama Islam"
          ],
          "responses":[
              "Di dalam kitab Fikih Musik Syaikh Yusuf Al-Qardhawi yang sudah diterjemahkan dalam bahasa indonesia. Dijelaskan bahwa jika musik itu mengingatkan pada kematian atau semangat berjihad maka boleh, atau boleh memuji Nabi Muhammad SAW, juga boleh. Kalau lagu itu isinya mengarah ke ajakan zina maka haram. Begitu pula dengan uang didapat hasil dari musik yang dimainkannya diharamkan maka uang yang dihasilkan juga demikian. Apaun jenis aliran musik baik rock, metal, jazz pop, atau aliran musik lain, kalau maknanya baik makadiperbolehkan jika maknanya tidak baik makan itu yang diharamkan"
          ]
      },
      {
          "tag":"Game",
          "patterns":[
              "Apa hukum bermain video game",
              "Apakah ada dalil-dalil dalam Al-Qur'an atau Hadis yang mengatur tentang bermain game?",
              "Apakah ada jenis permainan tertentu yang dianggap haram dalam Islam",
              "Apakah ada dalil-dalil dalam Al-Qur'an atau Hadis yang mengatur tentang bermain game",
              "Apa yang dapat menjadi pertimbangan dalam memutuskan apakah boleh bermain game atau tidak dalam Islam"
          ],
          "responses":[
              "Mazhab Hanafi mengharamkan bermain dadu. ada dua alasan. Pertama, mubazir waktu. Kedua, melalaikan sholat. begitu juga dengan video game, dapat mubazir waktu dan melalaikan shalat"
          ]
      },
      {
          "tag":"Suara Wanita adalah Aurat",
          "patterns":[
              "Bagaimana hukum wanita bernyanyi",
              "Bagaimana hukum para qariah yang didengar oleh para lelaki",
              "Apa yang dimaksud dengan “aurat suara” wanita dalam konteks Islam",
              "Apa dasar atau dalil dalam Al-Qur'an atau Hadis yang mengatur tentang suara wanita sebagai aurat",
              "Bagaimana pandangan ulama terkemuka tentang suara wanita sebagai aurat"
          ],
          "responses":[
          "Dikutip dari buku Fiqih Perempuan Kontemporer oleh Farid Nu'man, mengatakan ulama dari golongan Hanafiyah menyatakan bahwa suara perempuan adalah aurat. Sementara pendapat mayoritas ulama lain berpendapat suara perempuan bukanlah aurat asalkan tidak diperdengarkan dengan tujuan mengundang syahwat. Laki-laki diperbolehkan mendengar suara perempuan namun jika suara tersebut memancing fitnah yang bisa melahirkan syahwat atau sengaja menggoda lewat suara maka digolongkan aurat dan diharamkan. Ada beberapa alasan yang dijadikan dasar oleh pihak yang mengatakan bahwa suara perempuan adalah aurat. Firman Allah SWT dalam surat An-Nuur ayat 31 yang berbunyi:\n\"...Dan, janganlah mereka menghentakkan kaki mereka agar diketahui perhiasan yang mereka sembunyikan...\". Untuk Qari'ah tidak mengapa karena melatunkan ayat suci al-qur'an"
          ]
      },
      {
          "tag":"Orang tua bermasalah",
          "patterns":[
              "Apa yang harus dilakukan ketika orang tua bertengkar hingga terdengar oleh tetangga",
              "Apa yang diajarkan oleh Al-Qur'an dan Hadis tentang pentingnya hubungan harmonis antara orang tua?",
              "Bagaimana sebaiknya anak-anak menghadapi pertengkaran orang tua mereka dalam kerangka ajaran Islam",
              "Apakah ada hikmah atau pelajaran yang dapat dipetik dari pertengkaran orang tua dalam Islam",
              "Apakah boleh menceramahi orang tua yang sedang bertengkar"
          ],
          "responses":[
              "Dalam Al-Qur'an pada surat An-Nisa ayat 114 yang berbunyi:\n\"قال الله تعالى: {لا خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحِ بَيْنَ النَّاسِ وَمَن يَفْعَلْ ذَلِكَ ابْتَغَاء مَرْضَاتِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا\"\nArtinya : \"Tidak ada kebaikan pada kebanyakan bisikan mereka, kecuali bisikan-bisikan dari orang yang menyuruh (manusia) memberi sedekah, atau berbuat ma'ruf, atau mengadakan perdamaian di antara manusia. Dan barang siapa yang berbuat demikian karena mencari keridhaan Allah, maka kelak kami memberikan kepadanya pahala yang besar.\". Yang harus diingat, jangan sekali-kali menceramahi orang tua. Karena kita ini tidak pernah\"tua\"dihadapan orang tua. Kita tetaplah seseorang anak di hadapan mereka." 
          ]
      },
      {
          "tag":"Zina",
          "patterns":[
              "Apakah zina termasuk dosa besar",
              "Apa itu zina mata",
              "Apa hukuman bagi para pezina dalam islam",
              "Apakah terdapat dalil-dalil dalam Al-Qur'an atau Hadis yang mengatur tentang zina",
              "Apakah ada jalan tobat bagi mereka yang pernah terlibat dalam zina dalam Islam"
          ],
          "responses":[
              "Dalam Al-Qur'an pada surat An-Nisa ayat 114 yang berbunyi:\nالزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا كُلَّ وَاحِدٍ مِنْهُمَا مِائَةَ جَلْدَة وَلَا تَأْخُذْكُمْ بِهِمَا رَأْفَةٌ فِي دِينِ اللَّهُ إِنْ كُنْتُمْ تُؤْمِنُو بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَلْيَشْهَدْ عَذَابَهُمَا طَائِفَةٌ مِنَ الْمُؤْمِنِينَ\nArtinya:\"Perempuan yang berzina dan laki-laki yang berzina, maka cambuklah tiap-tiap seorang dari keduanya seratus dali dera, dan janganlah belas kasihan kepada keduanya mencegah kamu untuk (menjalankan) agama Allah, jika kamu beriman kepada Allah, dan hari akhir, dan hendaklah (pelaksanaan) hukuman mereka disaksikan oleh sekumpulan orang-orang yang beriman.\"\nAyat diatas merupakan hukuman pezina yang belum menikah. Sedangkan untuk pezina yang sudah menikah hukumannya baik itu laki-laki maupun perempuan mereka dilempari batu sampai mati atau yang dikenal dengan hukum Rajam. Jika anda pernah melakukan zina dan pasangan anda atau anda hamil dan menggugurkan kandungan tersebut dan sekarang anda menyesal dan ingin menebus kesalahan anda maka yang harus dilakukan yaitu mandi tobat, lalu berwudhu dan sholat tobat dua raka'at dan niatkan sholat itu kepada Allah dan perbanyaklah istigfar.Zina itu tidak hanya berkaitan dengan seksual tetapi juga namanya zina mata seperti didalam hadist qudsi menyebutkan\"Allah sudah menuliskan zina bagi anak Adam. Zina mata adalah memandang, zina telinga adalah mendengar, dan zina hati adalah berkeinginan. Kemaluan mengikuti atau menolaknya."
          ]
      },
      {
          "tag":"Menikah_0",
          "patterns":[
              "Apakah sah wanita hamil dinikahi oleh laki-laki yang telah menzinahinya",
              "Apakah anak yang hasil perzinahan ayah dan ibunya sebelum menikah dan ayah anak itu bisa menjadi wali nikahnya ",
              "Bagaimana laki-laki yang ingin menikahi wanita yang sedang hamil walaupun bukan laki-laki itu yang menghamili",
              "Bagaimana anak hasil zina yang tidak dinisbatkan kepada bapaknya",
              "Apa saja syarat untuk menjadi wali nikah"
          ],
          "responses":[
              "Dalam kitab al-Fiqhul Islamiy wa Adillatuhu, Syaikh Wahbah Az-Zuhaili menjelaskan, kalau ada laki-laki yang menikahi wanita yang sudah hamil maka nikahnya itu sah, tak ada yang salah. Yang jadi masalah adalah ketika anaknya lahir. Ketika lahir maka akan timbul 4 masalah, yaitu\n1. Anak itu tidak boleh menggunakan bin atau binti bapaknya.\n2. Kelak anak itu tidak bisa menjadi wali bagi adik-adik perempuannya karena dia dianggap bukan anak bpaknya, hanya anak ibunya.\n3. Ketika sang ayah meninggal maka anak itu tidak berhak mendapatkan warisan.\n4. Kalau anak itu perempuan maka kelak ayahnya tidak bisa menajdi wali ketika dia menikah.\nJika wanita yang dinikahi tersebut sudah hamil dan yang menikahi bukanlah laki-laki yang menghamili wanita tersebut maka harus menunggu dia melahirkan maka boleh dinikahi. Untuk anak yang tidak dapat dinisbatkan kepada bapaknya, maka bisa dinisbatkan kepada hamba Allah kemudian didaftarkan  ke surat-surat resmi seperti akte kelahiran dan lain-lain.  Orang yang berhak menjadi wali nikah bagi pihak perempuan adalah:ayah, atau kakek, atau kakak laki-laki,atau adik laki-laki, atau kakak ayahnya, atau adik ayahnya. Kalau semua itu tidak ada, boleh diwakili oleh keponakan laki-laki atau sepupu laki-laki. Jika misalnya anak itu merupakan anak angkat maka yang menjadi walinya adalah wali hakim  "
          ]
      },
      {
          "tag":"Menikah_1",
          "patterns":[
              "Bagaimana cara menasihati orang lain untuk menikah",
              "Bagaimana dengan perasaan sudah ada dan ingin menikahi akhwat tetapi ada kendala yang menghalangi",
              "Apakah masa lalu harus diberitahu kepada calon pasangan"
          ],
          "responses":[
              "Ada beberapa sebab laki-laki tidak menikah yaitu:\n1. Cinta ilmu seperti yang dilakukan oleh Imam Nawawi.\n2. Impoten atau kondisi lain yang dikhawtirkan bisa menyakiti istri jika menikah.\n3. Patah  hati. Jika kondisinya sperti ini maka bangkitkan semangatnya untuk menikah.\nJika sudah mantap ingin menikah dan terdapat halangan misalnya sedang kuliah maka lebih baik selesaikan dulu kuliahnya, lupakan akhwat tersebut dan tundukkan pandangan dari hal-hal yang membuat ingin menikah dan setelah lulus bisa saja dapat yang lebih baik darinya. Disaat kita sudah ingin menikah dan kita ada masa lalu yang kelam, Ibnu Tamiyah dalam Kitab Majmu' Fatawa, dikutip oleh Sayyid Sabiq dalam kitab Fikih Sunnah mengatakan,\"Kalau seorang suami mensyaratkan istrinya harus perawan, dan ternyata dia tidak perawan, maka dia punya hak membatalkan pernikahan.\"Jadi kalau masa lalunya itu tidak fatal, tidak diceritakan tidak apa-apa. Tetapi kalau dirasa berdampak pada hukum yang disebutkan, maka sebaiknya berterus terang"
          ]
      },
      {
          "tag":"Haid",
          "patterns":[
              "Bolehkah membaca Al-qur'an ketika sedang haid?",
              "Bagaimana cara mencari pahala ketika sedang haid?",
              "Apakah boleh shalat ketika sedang haid?",
              "Bolehkah memegang Al-Qur'an ketika sedang haid?"
          ],
          "responses":[
              "Empat madzhab (Hanafi, Maliki, Syafi'i, Hambali) sepakat untuk melarang wanita yang sedang haid memegang Al-Qur'an\n1, tak boleh bawa Qur'an, tak boleh baca Qur'an\n2, tak boleh i'tikaf dimasjid, tak boleh shalat\n3, tak boleh thawaf. kalau dzikir? boleh. Baca Bismillah? boleh.\nsebelum makan tetap membaca bismillah. Baca ayat saat berkendara?, boleh.\n"
          ]
      },
      {
          "tag":"Poligami",
          "patterns":[
              "Apa pendapat tentang poligami?",
              "Apa dalil Al-Qur'an tentang poligami?",
              "Bagaimana nasib dan kehidupan istri pertama?",
              "Bagaimana perundang-undang Indonesia menyikapi poligami?"
          ],
          "responses":[
              "Allah subhanahu wa ta'ala berfirman:\n\n وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانكِحُواْ مَا طَابَ لَكُم مِّنَ النِّسَاء مَثْنَى وَثُلاثَ وَرُبَاعَ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُواْ فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ذَلِكَ أَدْنَى أَلا تَعُولُوا \nArtinya:\"Dan jika kamu tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu menikahinya), maka nikahilah wanita-wanita (lain) yang kamu senangi:\n dua, tiga atau empat. kemudian jika kamu takut tidak dapat berlaku adil, maka (nikahilah) seorang saja, atau budak-budak yang kamu miliki. Yang demikian itu adalah lebih dekat kepada tidak berbuat aniaya.(Qs.an-nisaa:3)" 
          ]
      },
      {
          "tag":"Sikap terhadap suami",
          "patterns":[
              "Apa hukumnya istri membentak suami?",
              "Bagaimana cara istri melayani suami?",
              "Apakah boleh istri membantah suami?",
              "Apa dalil Al-Qur'an tentang taat terhadap suami?"
          ],
          "responses":[
              "Tak boleh. Nusyuz, durhaka.\n\n وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا إِنَّ اللَّهُ كَانَ عَلِيًّا كَبِيرًا\n Artinya:\"Wanita-wanita yang kamu khawatirkan nusyuznya, maka nasehatilah mereka dan pisahkanlah mereka di tempat tidur mereka, dan pukullah mereka. Kemudian jika mereka mentaatimu, maka jangnlah kamu mencari-cari jalan untuk menyusahkannya. Sesungguhnya Allah Mahatinggi lagi Mahabesar\".(Qs.an-Nisa':34)"
          ]
      },
      {
          "tag":"Aurat",
          "patterns":[
              "Apakah tangan termasuk aurat bagi wanita?",
              "Bagaimana cara menjaga dirinya dari laki-laki?",
              "Apa dalil Qur'an tentang menutup aurat?",
              "Bagian mana sajakah aurat bagi laki-laki?"
          ],
          "responses":[
              "Pendapat yang mengatakan bahwa wajah dan telapak tangan bukan aurat adalah pendapat Aisyah, Ibnu Abbas, dan Ibnu Umar. Pendapat ini didapat dari para ahli Fiqh. Oleh sebab itu Ibnu 'Abdilbarr berkata dalam at-Tamhid:\n\"Para ulama berbeda pendapat tentang ta'wil firman Allah, wala yubdina zinatahunna illa ma zhahara minha (Qs.an-Nur:31). Diriwayatkan dari Ibnu Abbas dan Ibnu Umar: 'Kecuali yang biasa tampak, yaitu wajah dan kedua telapak tangan.' Diriwayatkan dari Ibnu Mas'ud: 'Yang tampat terlihat dari atas pakaian, tidak boleh memperlihatkan anting-anting, rantai, gelang tangan, dan gelang kaki, kecuali yang tampak diatas pakaian.'Para tabi'in berbeda pendapat berdasarkan kedua pendapat ini. Para ahli Fiqh juga berbeda pendapat berdasarkan ini.\nMenurut Mazhab Syafi'i: Ar-Rahibani berkata dalam Syarh al-Ghayah,\"Menutup seluruh kepala lebih utama, karena kepala itu aurat baik di dalam shalat maupun diluar shalat. Tidak hanya ketika ihram. Berbeda dengan memperlihatkan wajah."
          ]
      },
      {
          "tag":"Pemimpin",
          "patterns":[
              "Bagaimana tanggapan ustadz tentang ulama yang mengajak memilih pemimpin kafir?",
              "Apa dalil Al-Qur'an tentang pemimpin kafir?",
              "Bagaimana dengan pemimpin muslim yang mengijinkan berdirinya rumah ibadah agama lain di daerahnya?",
              "Apakah hanya presiden dan gubernur saja yang disebut pemimpin?"
          ],
          "responses":[
              "Siapa di antara kalian yang memilih orang kafir maka dia ikut dengan si kafir, itu tidak bisa ditawar\n\n وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَمَا لَكُمْ مِنْ دُونِ اللَّهُ مِنْ أَوْلِيَاءَ ثُمَّ لَا تُنْصَرُونَ \n Artinya:Janganlah kalian cenderung kepada orang-orang zalim sehingga kalian disentuh api neraka. Sekali-kali kalian tidak mempunyai seorang penolong pun selain Allah, kemudian kalian tidak akan diberi pertolongan.(QS.Hud [11]:113)\"\"Dia dapat dosa jariyah, mengalir terus. Barang siapa berbuat baik maka dia dapat pahalanya, dan barang siapa berbuat tidak baik maka dia mendapat dosanya dan dosa orang yang mengerjakan karenanya sampai kiamat\" \"Tidak benar, Bupati juga termasuk pemimpin yang dimaksud dalam Al- Qur'an\""
              

          ]   
      },
      {
          "tag":"Riba",
          "patterns":[
              "Apa hukum meminjam uang di bank?",
              "Bagaimana jika terpaksa menabung di bank konvensional?",
              "Apa hukumnya menggunakan jasa bank konvensional, karena diwajibkan oleh instansi untuk sarana gaji dan sertifikasi?",
              "Apa hukum kredit, arisan, dan sejenisnya?"
          ],
          "responses":[
              "Riba Silakan, tapi bunganya jangan dimakan. Serahkan uang hasil bunga itu ke pihak yang nikmati orang banyak seperti panti jompo, panti asuhan, pembangunan mesjid, dan sebagainya Boleh saja, sekedar untuk numpang lewat. Setelahnya, uang gaji atau sertifikasi itu diambil dan disimpan di bank syariah Eiba. Tidak Boleh"      ]
      },
      {
          "tag":"Judi",
          "patterns":[
              "Bagaimana cara menyadarkan teman yang kecanduan judi?",
              "Apakah ada dalil tentang judi?"
              
          ],
          "responses":[
              "Panggil saja polisi. Biar ditangkap, terus dia tobat \"(QS.Al-Baqarah:219) yang artinya: Mereka bertanya kepadamu tentang khamar(minuman keras)dan judi. Katakanlah Pada keduanya terdapat dosa yang besar dan beberapa manfaat bagi manusia.Tetapi dosa keduanya lebih besar daripada manfaatnya\""
          ]
      },
      {
          "tag":"Sogok atau Suap",
          "patterns":[
              "Apa hukumnya cari kerja dengan menyogok?",
              "Apakah gaji yang diterima setiap bulan halal atau haram dari seorang pekerja dengan menyogok?"
          ],
          "responses":[
              "Nabi SAW bersabda yang artinya: Rasulullah SAW melaknat penyuap dan orang yang disuap.(Hadist Riwayat Abu Dawud, kitab Al-Aqdiiyah 3580, At-Tirmidzi, kitab Al-Ahkam 1337 dan Ibnu Majah, kitab Al-Ahkam 2313)\"\"SOGOK itu ada dua. Harap diperhatikan, jangan sampai nanti ada yang menganggap saya membolehkan suap. Misalnya ada penerimaan CPNS dengan syarat A,B,C. Seorang pelamar sudah memenuhi syarat A,B,C itu dan diterima, tapi ketika sampai pada petugas, sang petugas minta sesuatu, Wani piro (berani bayar berapa)? Akhirnya si pelamar membayar sesuai per- mintaan di oknum petugas. Nah, dalam kasus begini, sang pelamar tidak salah. Kalau kelak dia menjadi PNS dan menerima gaji maka gajinya halal. Yang zalim ada- lah oknum petugas itu. Misalnya kayak kasus tadi. Sebenarnya si pelamar tidak memenuhi syarat A,B,C, tapi karena ia memberi uang sogok berlipat lantas ia diterima sebagai PNS. Nah, PNS yang seperti ini yang salah, gajinya haram, uang tunjangannya juga haram."
          ]
      },
      {
          "tag":"Rezeki",
          "patterns":[
              "Apa yang membuat rezeki terhambat?",
              "Apa dalil tentang rezeki?"
      
          ],
          "responses":[
              "Bekerja keras dan banyaklah berdoa. Jika ada hutang, solusi hutang amalkan doa dari Nabi saw., Allahumma inni a'udzubika minal hamni wal hazan, wal 'ajzi wal kasal, wal jubni wal bukhul, wa min ghalabatid-daini wa qahrir-rijal. Kalau masih belum diberi rezeki melimpah, tetaplah husnuzhan kepada Allah.\" \"(QS.Fathir:3) yang artinya: Hai manusia, ingatlah akan nikmat Allah kepadamu. Adakah pencipta selain Allah yang dapat memberikan rezeki kepada kamu dari langit dan bumi?"
          ]
      },
      {
          "tag":"Mencuri",
          "patterns":[
              "Apa hukumnya mengambil milik orang lain yang hampir tidak ada nilainya dan sudah menjadi kebiasaan antarteman?",
              "Apa hukumnya mendownload aplikasi bajakan, tetapu aplikasi originalnya milik orang kafir?"
          ],
          "responses":[
              "Barang siapa berbuat kejahatan meskipun hanya sebesar zarrah, niscaya dia akan melihat balasannya pula (QS. az-Zalzalah ayat 8)\" \"Kalau itu sudah menjadi milik umum, tidak apa-apa. Tapi kalau ada yang dirugikan meskipun yang dirugikan itu orang kafir tidak boleh\"."
          ]
      },
      {
          "tag":"Barang Temuan",
          "patterns":[
              "Jika menemukan barang disuatu tempat dan sudah diinformasikan ada barang ditemukan ditempat tersebut tetapi tidak ada yang mengambilnya, bolehkah jam itu dipakai?",
              "Apakah ada dalil tentang barang temuan?"
          ],
          "responses":[
              "Barang itu menjadi milikmu kalau sudah ketahuan tidak ada pemiliknya. Satu tahun barang itu tidak ada yang mengambil maka itu jadi milikmu, karena kamu sudah membuat pengumuman berita kehilangan\" \"Rasulullah ditanya tentang barang temuan berupa emas atau perak, lalu beliau berkata, Kenalilah wadah atau tutupnya, dan pengikatnya, lalu umumkan satu tahun, jika tidak diketahui maka gunakanlah dan hendaknya barang itu bagaikan titipan di sisimu tetapi jika datang pemiliknya mencari barang itu suatu hari dari masa, maka serahkanlah barang itu padanya (HR. Bukhari 2249, dan Muslim 3249, dan lafadhnya dari Muslim"
          ]
      },
      {
          "tag":"Kematian",
          "patterns":[
              "Bagaimana jika ada orang yang mati karena disihir, apakah ia termasuk mati dijalan Allah atau tidak?",
              "Apakah ada dalil tentang kematian?"
          ],
          "responses":[
              "Selama dia bersabar, selalu ingat Allah, dan melakukan upaya yang tidak menyalahi hukum Allah makan matinya termasuk syahid. Lain jika ketika disihir ia malah melakukan pengobatan dengan cara meminta bantuan dukun atau sejenisnya maka matinya tidak syahid\"\"(QS. al-Baqarah:102) yang artinya: Dan mereka mengikuti apa yang dibaca oleh setan-setan pada masa kerajaan sulaiman dan mereka mengatakan bahwa sulaiman itu mengerjakan sihir, padahal sulaiman tidak kafir tidak mengerjakan sihir, hanya setan-setan lah yang kafir mengerjakan sihir. Mereka mengajarkan sihir kepada manusia"
          ]
      },
      {
          "tag":"Ujian Hidup",
          "patterns":[
              "Apakah ada hadis yang menyebutkan bahwa ketika seseorang yang sudah ditempatkan Allah pada tempat tertentu tapi amalnya kurang, maka Allah akan menguji dia?",
              "Ungkapan addunya mazra'atul akhirah(dunia adalah kebun akhirat). Apakah ini hadis?"
          ],
          "responses":[
              "HADIS tersebut adalah:\nDari Muhammad bin Khalid, dari bapaknya, dari kakeknya, ia seorang sahabat Rasulullah saw., ia mengunjungi salah se- orang saudaranya. Sebelum sampai, ia mendapat kabar bahwa saudaranya itu sakit, ketika ia menemuinya, ia ber- kata, Saya datang menjengukmu sebagai orang yang men- jenguk orang sakit dan memberi kabar gembira.Saya sampaikan kabar gembira kepadamu tentang sesuatu yang pernah saya dengar dari Rasulullah saw., beliau bersabda: 'Apabila Allah swt. telah menempatkan seseorang pada suatu tempat kemuliaan, akan tetapi amal orang itu tidak layak membuat ia berada di tempat itu, maka Allah swt. menguji hamba itu pada tubuhnya, atau hartanya, atau anaknya, kemudian Allah swt. buat hamba itu sabar hingga ia layak berada di tempat kemuliaan itu. (Menurut Syaikh Husain Salim Asad, hadis ini dha'if atau lemah, tahqiq dari Kitab Musnad Abi Ya'la)\" \"Imam as-Sakhawi berkata, Saya tidak menemukannya (sebagai hadis).\n\nعنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ الله صلى الله عليه وسلم منكبي فَقَالَ: (كن في الدُّنْيا كَأَنَّكَ غَريب أو عَابِرُ سَبِيلِ ( وَكَانَ ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُ: إِذَا أَمْسَيْتَ فَلَا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا اصبحت فلا \nتَنتَظِرِ المَسَاءَ وَخُذْ مِنْ صِحْتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لموتك - رواه البخاري Artinya:\nDari Ibnu Umar radhiallahu 'anhuma, ia berkata: Rasulullah Shallallahu 'alaihi wa Sallam memegang pundakku, lalu bersabda Jadilah engkau di dunia ini seakan-akan sebagai orang asing atau pengembara. Lalu Ibnu Umar radhiyallahu anhuma berkata: Jika engkau di waktu sore, maka janganlah engkau menunggu pagi dan jika engkau di waktu pagi, maka janganlah menunggu sore dan pergunakanlah waktu sehatmu sebelum kamu sakit dan waktu hidupmu sebelum kamu mati. (HR. Bukhari no. 6416"
          ]
      },
      {
          "tag":"Hobi",
          "patterns":[
              "Bolehkah memelihara burung",
              "Apakah ada larangan dalam agama Islam terkait dengan hobi tertentu",
              "Apakah ada hadist atau alqur'an yang berkaitan dengan hobi"
          ],
          "responses":[
              "Seorang sahabat yang bernama Abu Umair juga memelihara burung, dan Nabi SAW. tidak melarang. Bahkan saat burung itu mati, nabi bertanya, \"Hai, Abu Umair. Kenapa burungmu?\". Tapi kalau memelihara burung harus memenuhi syarat: Sangkarnya besar, makan dan minumnya cukup, harus ada pasangan. kalau ketiga syarat  itu tidak dipenuhi maka itu sama saja dengan menyiksa burung tersebut. Jadi mempunyai hobi itu diperbolehkan."
          ]
      },
      {
          "tag":"Aksesoris",
          "patterns":[
              "Apakah nabi muhammad memakai cincin",
              "Jenis cincin apakah yang diperbolehkan",
              "Nabi Muhammad memakai cincin di jari yang mana",
              "Nabi Muhammad memakai cincin di tangan kanan atau tangan kiri",
              "Pada bagian mana cincin dipasang"
          ],
          "responses":[
              "Dari Anas radhiallahu anhu berkata:\n\nكَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ وَأَشَارَ إِلَى الْخِنْصِرِ مِنْ يَدِهِ الْيُسْرَى (رواه مسلم، رقم 2095)\n\nArtinya:\n\"Dahulu cincin Nabi sallallahu alaihi wa sallam di sini sambil menunjuk ke jari kelingking tangan kanan.\"(HR. Muslim, no.2095)\nDalam kitab Syarah Shahih Muslim karya Imam An-Nawawi disebutkan: Dari hadist Thalhah bin Yahya dan Sulaiman bin Bilal. Dari Yunus, dari Ibnu Syihab, dariu Anas,\"Sesungguhnya Nabi Rasulullah SAW. memakai cincin perak di sebelah kanan\"\nDalam hadist Ali,\"Rasulullah SAW. melarang saya memakai cincin di jari dan ini. Ia menunjuk jari tengah dan jari telunjuk\".Diriwayatkan dalam kitab lain selain Shahih Muslim.\"Jari Telunjuk dan Jari Tengah\".Kaum muslimin sepakat bahwa sunnah meletakkan cincin di jari kelingking. Sedangkan perempuan memakai cincin di jari-jemarinya.\nAdapun hikmah dalam masalah ini menurut para ahli fiqh mereka sepakat bahwa memakai cincin di sebelah kanan, boleh di sebelah kiri. Tidak makruh di kanan atau di kiri."
          ]
      },
      {
          "tag":"Salafi-Wahabi",
          "patterns":[
              "Bagaimana cara kita bergaul dengan teman yang bermazhab Salafi-Wahabi",
              "Apa hukum mengatakan segala sesuatu itu bid'ah",
              "Apakah sikap salafi yang mengatakan yang bid'ah itu ahli neraka itu termasuk sombong"
          ],
          "responses":[
              "Salafi ada 3 level:Bawah, tengah dan atas. Pengikut salafi yang level bawah masih bisa menjaga toleransi, tak masalah bergaul dengan salafi level bawah ini. Yang salafi level atas lebih banyak menyalahkan orang lain yang tak sepaham dengannya.\n\nروينا في صحيحي البخاري ومسلم عن أبي بردة بن أبي قال: وجع أبو موسى رضي الله عنه وجعا، فغشي عليه ورأسه في حجر امرأة من أهله ، فصاحت امرأة من أهله فلم يستطع أن يرد شيئا، فلما أفاق قال: أنا برئ ممن برى مه رسول الله (صلى الله عليه وسلم)، فإن رسول الله (صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقةقلت: الصالقة: الصائحة بصوت شديد والحالقة التي تحلق رأسها عند المصيبة والشاقة التي تشق ثيابهاعند المصيبة\n\nArtinya:\n\"Diriwayatkan kepada kami di Shahih Bukhari dan Muslim dari Abu Burdah bin Abi Musa, ia bercerita bahwa suatu hari Abu Musa ra. jatuh sakit tak saadarkan diri, Kepalanya berada di pangkauan salah seorang perempuan di keluarganya. Perempuan ini teriak histeris. Sementara Abu Musa ra. tak mampu menolak apapun. Setelah siuman, ia berkata 'Aku berlepas diri dari orang-orang yang mana Rasulullah SAW. berlepas darinya'. Sebagaimana diketahui, Rasulullah SAW. berlepas diri as-shaliqah, al-haliqah dan as-syaqqah. Menurutku, as-shaliqah adalah perempuan yang berteriak dengan keras. al-haliqah adalah perempuan yang mencukur rambut saat kena musibah. Sedangkan as-syaqqah adalah perempuan yang menyobek pakaian ketika musibah\".Pesan UStad Hadrima\"Jangan kau katakan bahwa sesorang itu pelaku bid'ah sebelum kamu benar-benar yakin bahwa itu adalah bid'ah berdasarkan dalil yang shahih. Karena itu sama saja kamu mengatakannya sebagai pelaku kesesatan, sama saja mengatakannya sebagai penghuni neraka"
          ]
      },
      {
          "tag":"Tokoh Muslim",
          "patterns":[
              "Siapa Imam Ja'far Shadiq",
              "Siapa Yusuf Al-Qardhawi",
              "Siapa Imam Hasan al-Bashri"
          ],
          "responses":[
              "Imam Ja'far Shadiq ini adalah gurunya Imam Hanafi. Silsilahnya dengan Nabi Muhammad SAW:Nabi Muhammad SAW-Fatimah-Husein-Zainal Abidin-Muhammad Baqir\" \"Yusuf Al-Qardhawi adalah lulusan S1, S2, dan S3 AL-Azhar Mesir. Sekarang menjadi ketua ikatan ulama sedunia, berkantor di Doha, Qatar. Dia masih hidup, sebagai salah satu ulama tertua saat ini\" \"Imam Hasan al-Bashri tinggal di kota Irak (Bashrah) sehingga masyhur dipanggil al-Bashri, Beliau adalah ulama generasi tabi'in (Setelah era para sahabat Nabi)"
          ]
      },
      {
          "tag":"Memuliakan Nabi dan Keturunannya",
          "patterns":[
              "Siapa yang sebenarnya yang berhak dipanggil Habib",
              "Kenapa sebagian orang tidak mau memanggil nabi muhammad dengan tambahan sayyidina",
              "Bolehkah kita memakai nama sayyidina kepada nabi muhammad",
              "Apakah arti Habib"
          ],
          "responses":[
              "Nabi Muhammad Saw. pernah berkata yang artinya:\n\"Barangsiapa yang lamban amalnya, maka nasabnya tidak bisa mengejarnya\"\nHabib artinya yang tercinta, orang yang selalu memanggil dua cucunya (Hasan dan Husein) dengan panggilan ya habibi, wahai yang kucinta. Panggilan ini berlanjut, orang-orang memanggil anak cucu hasan dan husein dengan panggilan \"Habib\" sebagai ungkapan sayang kepada sang leluhur mereka, yakni Rasulullah Saw. Untuk kata sayyidina untuk nabi muhammad boleh saja dipakai karena beliau sendiri yang mengatakan \"Ana Sayyidu waladi Adam, Aku adalah pemimpin anak cucu adam\"Untuk yang sebagian orang yang tidak mau memakai kata sayyidina karena mereka menganggap kalau itu tindakan menambah-nambah"
          ]
      },
      {
          "tag":"Berbakti Kepada Orang Tua",
          "patterns":[
              "Bagaimana dengan orang tuanya yang sudah tua dan anak laki-laki tersebut ingin merawat orang tua sedangkan istrinya meminta pisah rumah dengan mertua",
              "Apakah boleh sudah menikah tetapi tetap tinggal dengan orang tua",
              "Apakah boleh meninggalkan orang tua yang sudah tua di rumah sendirian"
          ],
          "responses":[
              "Allah SWT. Berfirman dalam surat AN-Nisa ayat 36 yang artinya:\"Sembahlah Allah dan jangan kamu mempersekutukannya dengan sesuatupun. Dan berbuat baiklah kepada dua orang ibu-bapa...\"Untuk seorang istri, kita sebagai suami jelaskan dengannya baik-baik dan pelan. Istri itu ibarat tulang rusuk yang bengkok, luruskan dengan lembut dan sabar, kalau dikerasi malah patah. Tapi kalau laki-laki mengikuti istri, bisa-bisa suami yang ikut bengkok. Yang jelas pandai-pandailah laki-laki memberi pengertian pada istri tentang masalah"
          ]
      },
      {
          "tag":"Silaturahmi",
          "patterns":[
              "Apakah arti silaturahmi",
              "Apa hukum memutuskan tali silaturahmi",
              "Apakah ada hadist atau alqur'an yang menjelaskan tentang silaturahmi",
              "Apa balasan yang menjaga silturahmi"
          ],
          "responses":[
              "Disebutkan dalam Shahih al-Bukhari dan Shahih Muslim, dari Abu Ayyub al-Anshari yang artinya:\n\"Bahwasanya ada seseorang berkata kepada Nabi Muhammad SAW.:\"Wahai Rasulullah, beritahukan kepadaku tentang sesuatu yang bisa memasukkan aku ke dalam surga dan menjauhkanku dari neraka,\"maka Nabi Muhammad Saw. bersabda:\"Sungguh dia telah diberi hidayah , apa yang tadi engkau katakan?\"Lalu orang mengulangi lagi perkataannya. Setelah itu NAbi Muhammad SAW. bersabda:\"Engkau beribadah kepada Allah dan tidak menyekutukannya dengan sesuatu pun, menegakkan shalat, membayar zakat, dan engkau menyambung silturahim\". Setelah orang itu pergi , Nabi SAW. bersabda:\"Jika dia melaksanakan apa yang aku perintahkan tadi, pastilah dia masuk surga.\"Silaturahmi terdiri dari dua kata, kata shiladu dan kata rahim. Bila diterjemahkan secara bahasa, kedua kata ini membingungkan. Jadi makna silaturahim sebenarnya dulu kita berasal dari satu rahim, yaitu rahim hawa. Lalu kita terlahir dari rahim -rahim yang berbeda. Kemudian kita diuji untuk menyatukan dan mengeratkan ikatan rahim itu kembali, selayaknya sebelum berpisah.\nBalasan orang yang menjalin silaturahmi dapat melapangkan rezeki dan memperpanjang umur, padahal rezeki dan umur sudah ditetapkan Allah SWT, maka menurut Syekh Mutawalli Asy-Sya'rawi, yang ditambahkan Allah dengan silaturahmi adalah keberkahan umur dan rezeki, itulah yang selalu kita mohonkan kepada Allah Swt. Hukum memutuskan tali silaturahmi adalah yang paling berat adalah tidak masuk surga dan ada juga hadist Nabi Muhammad Saw. yang artinya:\"Tidak halal bagi seseorang mendiamkan saudaranya lebih dari 3 malam. Mereka berdua bertemu ini menolak ini dan ini menolak ini. Yang paling baik di antara mereka berdua adalah orang memulai salam.\""
          ]
      },
      {
          "tag":"Mendidik Anak",
          "patterns":[
              "Bolehkah saya mendidik anak dengan keras dalam urusan agama",
              "Bagaimana cara mendidik anak dengan baik & benar",
              "Apakah boleh anak membantah perkataan Orang Tua",
              "Bagaiamana etika anak terhadap Orang Tua"
          ],
          "responses":[
              "Dalam sebuah hadis Rasulullah mengatakan yang artinya:\n\"Suruhlah anak-anakmu melakukan shalat diwaktu dia berumur tujuh tahun, dan pukullah mereka kalau sudah berumur sepuluh tahun dan pisahkanlah tempat tidur diantara mereka (maksudnya antara anak laki-laki dan perempuan).(HR. Abu Daud)"
          ]
      },
      {
          "tag":"Pernikahan",
          "patterns":[
              "Ayah saya mau menikah lagi, semenjak ibu saya meninggal dunia",
              "Apakah boleh melamar perempuan diatas lamaran orang yang telah melamarnya",
              "Bolehkah perempuan menentukan maharnya",
              "Apa yang perlu dipersiapkan pihak laki-laki sebelum menuju pernikahan"
          ],
          "responses":[
              "Bagus baik\n\nSekarang ini, banyak anak yang ketika ibunya meninggal dunia lantas meminta ayahnya tidak menikah lagi. Disuruhnya hidup sebatang kara, itu kurang baik. Biarkan ayah menikah lagi, dia butuh teman hidup dan kenyamanan. jadi anak itu jangan egois terhadap Orang Tua"
          ]
      },
      {
          "tag":"Pernikahan_0",
          "patterns":[
              "Seberapa pantas wanita harus berlaku sabar terhadap suami yang suka berbuat kasar, suka mencela makanan, dan suka membanding-bandingkan",
              "Apakah boleh suami berbuat kasar terhadap keluarga kecilnya",
              "Bolehkah istri bernada tinggi terhadap suami"
          ],
          "responses":[
              "Wahai laki-laki, tidak ada wanita yang sempurna. Sekarang boleh saja kamu katakan istrimu kurang ini kurang itu, kelak kalau sudah tak bersamanya lagi baru kau sadar betapa berharganya dia. Pepatah Arab mengatakan, siapa mencari kawan yang sempurna maka seumur hidup dia tak akan punya kawan, siapa yang mencari istri sempurna dia selamanya tak akan menikah.\n\n \"Wanita itu tercipta dari tulang rusuk yang bengkok. Jika kamu paksa dia untuk lurus maka bisa patah, tapi kalau kau biarkan maka kamu pun bisa ikut bengkok. Mka dari itu baik-baiklah bersikap terhadap istrimu, jangan berkata kasar kepadanya. Sabda Nabi,\"Orang yang paling baik di antara kalian adalah orang yang paling baik kepada istrinya."
          ]
      },
      {
          "tag":"Pernikahan_1",
          "patterns":[
              "Jika si A (laki-laki) berzina dengan si B (Perempuan), kemudia lahir anak C (Perempuan). Bolehkah si C dinasabkan kepada A",
              "Apa hukumnya dalam Islam anak hasil zina (sebelum menikah)",
              "Apakah anak hasil zina dapat membawa Orang Tua ke surga"
          ],
          "responses":[
              "Dari 'Aisyah ra. bahwasanya ia berkata:\nSa'd ibn Abi Waqqash dan Abd ibn Zam'ah berebut terhadap seorang anak lantas Sa'd berkata:\nWahai Rasulullah, anak ini adalah anak anak saudara saya 'Utbah ibn Abi Waqqash dia sampaikan ke saya bahwasanya ia adalah anaknya, lihatlah kemiripannya. 'Abd ibn Zum'ah juga berkata:\"Anak ini saudaraku wahai Rasulullah, ia terlahir dari pemilik kasur (firasy) ayahku dari ibunya. Lantas Rasulullash saw melihat rupa anak tersebut dan beliau melihat keserupaan yang jelas dengan 'Utbah, lalu Rasul bersabda:\"Anak ini saudaramu wahai 'Abd ibn Zum'ah. Anak itu adalah bagi pemilik kasur/suami dari perempuan yang melahirkan (firasy) dan bagi pezina adalah (dihukum) batu, dan berhijablah darinya wahai Saudah Binti Zam'ah. Aisyah berkata:\nia tidak pernah melihat Saudah sama sekali.(HR. Bukhari dan Muslim) "
          ]
      },
      {
          "tag":"Pernikahan_2",
          "patterns":[
              "A seorang anak laki-laki, B seorang anak perempuan. Mereka bersaudara seibu (lain ayah). Lalu B melahirkan seorang anak perempuan bernama C, lantas A menikah dengan C. Ada yang memperbolehkan, karena A dan B dianggap tidak saudara kandung, karena lain ayah.",
              "Apakah anak dari istri adeknya ayah muhrim",
              "Bagaimana hukum dalam Islam menikahi sepupu dari pihak Ibu"
          ],
          "responses":[
              "Itu tidak benar, mereka tidak boleh menikah"
          ]
      },
      {
          "tag":"Warisan",
          "patterns":[
              "Ke mana jatuhnya harta warisan anak yatim sementara ibunya sudah menikah lagi",
              "Apakah bukan anak kandung boleh mendapatkan bagian warisan dari ayah sambungnya",
              "Bagaimana cara membagi harta warisan terhadap anak",
              "Apakah boleh meminta harta warisan terlebih dahulu sebelum dibagikan"              
          ],
          "responses":[
              "Didata dulu, apa saja harta peninggalan anak yatim itu. Lalu ditunjuk seorang washiy yang bertugas menjaga harta tersebut. Seorang washiy tidak boleh mengambil harta tersebut untuk kepentingan dirinya, kecuali sebatas kepatutan saja layaknya mendapat gaji atas tugasnya itu. Setelah anak yatim itu dewasa, harta peninggalan bapaknya itu harus diserahkan kepadanya.."
          ]
      },
      {
          "tag":"Warisan_0",
          "patterns":[
              "Saya seorang ayah dengan 6 orang anak, 3 laki-laki dan 3 perempuan. Istri saya sudah meninggal, saya mau menikah lagi. apakah warisan harus segera dibagi",
              "Bagaimana jika harta warisan tidak dibagi rata kepada anak",
              "Apakah seorang istri mendapatkan harta warisan dari suami",
              "Bolehkah tidak membagikan harta warisan terhadap anak"
          ],
          "responses":[
              "Ayah mendapat seperempat karena masih menanggung anak. Misalnya, harta peninggalan ibu 1 miliar, maka ayah mendapat 250 juta. Sisanya yang 750 juta dibagi kepada ke enam anak dengan pembagian jatah untuk anak laki-laki 2 kali dari anak perempuan. Setelah itu, silahkan kalau mau menikah."
          ]
      },
      {
          "tag":"Perceraian",
          "patterns":[
              "Apakah sah talak yang diwakilkan dan lewat surat",
              "Apakah boleh dalam pernikahan mengucapkan kata talak",
              "Bolehkah meminta talak tanpa ada permasalahan dalam pernikahan"
          ],
          "responses":[
              "Suami mengirim pesan lisan, misalnya seorang suami berkata kepada sesorang, \"Pergilah engkau kepada si anu istri saya, katakan kepadanya:\n'Sesungguhnya suamimu telah berkata kepadaku bahwa engkau telah diceraikan.\" \"Jika utusan itu pergi kepada istri yang bersangkutan dan menyampaikan pesan lisan itu, maka talak pun jatuh. Utusan itu hanya membawa pesan, bukan orang yang menjatuhkan talak."
          ]
      },
      {
          "tag":"Perceraian_0",
          "patterns":[
              "Mengapa dalam Islam masa iddah itu hanya berlaku untuk perempuan saja",
              "Apakah masa Iddah itu perlu dilakukan dalam Islam",
              "Apa hukumnya dalam Islam melakukan masa iddah"
          ],
          "responses":[
              "Orang-orang yang meninggal dunia di antaramu dengan meninggalan istri-istri (hendaklah para istri itu) menangguhkan dirinya (ber'iddah) empat bulan sepuluh hari. Kemudian apabila telah habis 'iddahnya, maka tiada dosa bagimu (para wali) membiarkan mereka berbuat terhadap diri mereka menurut yang patut. Allah mengetahui apa yang kamu perbuat. (Qs.al-Baqarah:\n234)"
          ]
      },
      {
          "tag":"KB",
          "patterns":[
              "Apa hukumnya ikut program KB",
              "Apakah KB berlaku untuk laki-laki",
              "Mengapa perlu melakukan program KB",
              "Bolehkah tidak melakukan program KB"
          ],
          "responses":[
              "KB itu ada dua. Pertama, adalah menyengaja dalam jarak melahirkan. Misalnya 2 tahun sekali, 3 tahun sekali, 5 tahun sekali, itu boleh. Kedua, adalah dibatasi jumlahnya. Atau diputus sama seklai dengan cara vasektomi atau tubektomi, itu haram. Kecuali wanita yang kalau melahirkan berbahaya secara medis, ini boleh sebagai perkecualian."
          ]
      },
      {
          "tag":"Alkohol",
          "patterns":[
              "Boleh nggak memakai parfum yang di dalamnya mengandung alkohol",
              "Apakah boleh perempuan memakai parfum",
              "Bagaiamana jika sedang shalat sedang memakai parfum"
          ],
          "responses":[
              "Hukum alkohol terbagi dua. Pertama, alkohol yang berasal dari saripati kurma dan anggur lalu dipakai untuk selain minuman. Sebagian ulama tetap mengharamkan sesuai surat Al-Ma'idah ayat 90, yakni menganggap alkohol tersebut najis. Sebagian ulama yang lain menganggap bahwa alkohol itu secara dzatnya tidak najis, sehingga tidak haram. Kedua, alkohol yang berasal dari babi, semua ulama sepakat najis dan haram."
          ]
      },
      {
          "tag":"Membunuh Binatang",
          "patterns":[
              "Katanya membunh cecak itu harus sekali pukul, kalau membunuhnya sampai hancur apakah berpahala",
              "Bolehkah kita memakan cecak",
              "Apakah boleh membunuh babi sebagai makanan yang haram dalam Islam",
              "Apa hukumnya dalam Islam membunuh gajah dan diambil taringnya"
          ],
          "responses":[
              "Berpahala.\"Barang siapa yang membunuh cicak sekali pukul, maka dituliskan baginya pahala seratus kebaikan. Brang siapa memukulnya lagi, maka baginya pahala yang kurang dari pahala pertama. Barang siapa memukulnya lagi, maka baginya pahala lebih kurang dari yang kedua.(HR. Muslim)" 
          ]
      },
      {
          "tag":"Rasulullah saw membelah bulan",
          "patterns":[
              "Apa benar ada hadis yang mengatakan bahwa Nabi saw. pernah membelah bulan",
              "Apakah ada yang tidak percaya & yakin atas mukjizat Nabi",
              "Mengapa Rasulullah saw. membelah bulan"
          ],
          "responses":[
              "Dari Abdullah Berkata Bulan terbelah menjadi dua bagian di zaman Rasulullah, kemudian Rasulullah saw. bersabda:\"Saksikanlah.(HR.Muslim:7249)"
          ]
      },
      {
          "tag":"Menggunjing",
          "patterns":[
              "Apakah benar ada hadis yang mengatakan bahwa menggunjing atau menceritakan aib orang lain itu dosa besar",
              "Bagaimana caranya tidak terjerumus dalam menggunjing orang",
              "Apakah orang yang sedang digunjingkan mendapatkan pahala",
              "Seberapa besar dosa dalam menggunjing"
          ],
          "responses":[
              "Itu dos\nlain.Firman Allah swt.:\n\nيَأَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مَنْ قَوْمٍ عَسَى أَنْ يَكُونُوا خَيْرًا مِّنْهُمْ، وَ لا نِسَاءٌ مَنْ نَسَاءٍ عَسَى أَنْ يُكُنَّ خَيْرًا مِّنْهُنَّ وَ لَا تَلْمِزُوا أَنْفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ بِئْسَ الاِسْمُ الفُسُوقُ بَعْدَ الْإِيْمَانِ وَ مَنْ لَّمْ يَتُبْ فَأُولئِكَ هُمُ الظَّلِمُونَ . يأَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ الم ولا تَجَسَّسُوا وَلا يَغْتَبْ بَعْضُكُمْ بَعْضًا أَيُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ، وَاتَّقُوا اللَّهَ إِنَّ اللَّهَتَوَّابٌ رَّحِيم الحجرات: 11-12\nArtinya:\nHai orang-orang yang beriman, janganlah suatu kaum mengolok-olok kaum yang lain (karena) boleh jadi mereka (yang diolok-olok) lebih baik dari mereka (yang mengolok-olok) dan jangan pula wanita-wanita (mengolok-olok) wanita-wanita lain, (karena) boleh jadi wanita-wanita (yang diperolok-olok) lebih baik dari wanita (yang mengolok-olok) dan janganlah kamu mencela dirimu sendiri dan janganlah kamu panggil- memanggil dengan gelar-gelar yang buruk. Seburuk-buruk panggilan ialah (panggilan) yang buruk sesudah iman dan ba- rangsiapa yang tidak bertobat, maka mereka itulah orang- orang yang zalim. Hai orang-orang yang beriman, jauhkanlah kebanyakan dari prasangka, sesungguhnya sebagian prasangka itu adalah dosa dan janganlah kamu mencari-cari kesalahan orang lain dan janganlah sebagian kamu menggunjing sebagian yang lain. Sukakah salah seorang di antara kamu memakan daging saudaranya yang sudah mati? Maka tentulah kamu merasa jijik kepadanya. Dan bertaqwalah kepada Allah. Sesungguhnya Allah Maha Penerima tobat lagi Maha Penyayang. (QS.al-Hujuraat: 11-12) Kalau berada dalam sekumpulan orang yang menceritakan aib orang lain, langsung pergi saja. Jangan bergabung di dalamnya. Seberapa besar dosanya, Pak Ustadz? Dosa orang yang dibicarakan itu akan berpindah ke orang yang menceritakan. Itu sama saja memakan bangkai saudara sendiri, Adakah seorang di antara kamu yang suka memakan daging saudaranya yang sudah mati? (QS.al-Hujurat: 12) Bayangkan, pahala kita habis, dosa orang itu berpindah ke kita, kita makan pula bangkainya. Na'udzubillah min dzalik."
          ]
      },
      {
          "tag":"tidak_berwudu",
          "patterns":[
              "apakah bole jika kita tidak berwudu tapi kita azan",
              "azan tapi tidak berwudu apakah sah",
              "sah kah jika kita aszan tapi tidak berwudu"
          ],
          "responses":[
              "Azan nya sah, karena tidak disyaratkan berwudhu terlebih dahulu jika mau azan. Tapi lenoh afdal (utama) jika berwudu dulu. beda dengan shalat, kalau shalat harus wudu dulu.g"
          ]
      },
      {
          "tag":"shalat_ingat_Allah",
          "patterns":[
              "jika kita tidak khusyuk apakah sah solat kita",
              "jika kita tidak khusyuk apakah sah solat kita",
              "bagaimana caranya agar solat kita khusyuk"
          ],
          "responses":[
              "Ketika wudhu kita harus mulai ingat. Ingat apa? ingat kepada Allah. juga ingat bahwa ketika berkumur, keluar dosa dari mulut.Ketika membasuh muka, keluar dosa dari mata. ketika mencuci tangan, keluar dosa dari telapak tangan. Ketika mengusap kepala, keluar dosa dari kepala.\n\nAtas dasar ini makanya kalau sedang berwudu kita teteap menhaga ingatan kepada Allah dengan cara berdoa setelah wudhu sesuai Tuntuan\n\nTerus ketika memulai shalat, selaraskan antara ucapan dengan ingatan. Yakin, apa yang kita baca harus kita ketahui artinya. saat lisan membaca, meskipun sangat lirih, hati juga ikut mengikuti apa yang dibacanya itu. Makanya saat shalat sebaiknya mulit bergerak mengikuti bacaan.\n\nAda shabat Nabi saw, bernama Khabab ia di tanya, \"Hai, Khabab. Nabi kalau shalat mulutnya bergerak tidak?\" \"Ya\" Jawab Khabab. \"Bagaimana kamu tahu? memang kamu melihatnya?\" \"Sebab, saya lihat jenggot beliau ikut bergereak saat shalat\"\nBegitulah, meskipun suaranya sangat lirih dan hanya didengar oleh diri sendiri tapi mulut sebaiknya bergerak mengikuti bacaan shalat. Ini untuk menjaga hati terus ingat kepada Allah melalui bacaan yang di bacanya."
          ]
      },
      {
          "tag":"jarak_kaki_shalat",
          "patterns":[
              "berapa jarak kaki ketika shalat",
              "berapa jarak kaki kiri dan kanan ketika shalat",
              "berapa jarak kaki kanan dan kiri ketika shalat",
              "apakah ada ketentuan jarak kaki kiri dan kanan ketika shalat"
          ],
          "responses":[
              "Lebarnya sebahu jangan sampai kaki lebih lebar dari sebahu karena anjuran shalat adalah bahu menyentuh bahu kaki"
          ]
      },
      {
          "tag":"dalil_shalat_witir",
          "patterns":[
              "dalil shalat witir",
              "apa dalil shalt witir",
              "apa dalil shalat witir 3 rakaat tapi di kerjakan dengan 2 kali salam"
          ],
          "responses":[
              "dari 'Aisyah Ra., Ia berkata,\n\nكَانَ رَسُولُ الله - صلى الله عليه وسلم- يُصَلِّي في الْحُجْرَةِ وَأَنَا فِي الْبَيْتِ فَيَفْصِلُ بَيْنَ الشَّفْعِ وَالْوِتْرِبِتَسْلِيمٍ يُسْمِعُنَاهُ\nArtinya:\n\"Rasullulah shallallahu 'alaihi wa salam shalat di dalam kamar ketika saya berada di rumah dan beliau shallallahu 'alaihiwasalam memisah antara rakya't yang genap dengan yang witir (ganjil) dengan salam yang beliau shallallahu 'alaihiwasalam perdengarkan kepada kami\" (Hr. Ahmad 6: 83. Syaikh Syu'aib Al Arnauth mengatakan bahwa hadis ini shahih)"
          ]
      },
      {
          "tag":"shalat_witir_setelah_sunah",
          "patterns":[
              "apakah boleh shalat sunnah setelah shalat witir",
              "apakah boleh shalat sunnah lagi setelah shalat witir",
              "shalat sunah setelah shalat witir"
          ],
          "responses":[
              "Diriwayatkan oleh muslim dari aisah \"Rasulullah Saw. Shalat dua rakaat setelah witir. beliau shalat keadaan duduk\" Makna hatis ini menurut imam an-Nawawi adalah \"Boleh shalat sunah lagi setelah Witir, juga boleh shalat sunnah dalam keadan duduk\""
          ]
      },
      {
          "tag":"hukum_khatib_shalat_jumad",
          "patterns":[
              "hukum khutbah jumad sambil menggerak kan tangan",
              "hukum khutbah jumad sambnil menunjuk nunjuk",
              "apakah boleh khutbah jumad sambnil menunjuk nunjuk",
              "bolehkah khutbah jumad sambnil menunjuk nunjuk"
          ],
          "responses":[
              "Khutbahnya tidak batal, tapi sebaliknya tangan tidak perlu banyak gerak. Inni masalahnya adab saja. Maka para khatib saat berkutbah biasanya tangan kanan memegang mimbar sementara tangan kirinya memegang tongkat"
          ]
      },
      {
          "tag":"khatib_buang_angin",
          "patterns":[
              "apa hukumnya jika khatib buang angin ketika berkutbah",
              "ketika khatib buang angin saat berkhutbah apakah sah kutbahnya",
              "mana dalil yang menyebutkan khutbah khatib sah ketia ia buang angin"
          ],
          "responses":[
              "Jika ia menghadapi kondisi demikian, seharusnya khatib turun dari mimbar dan berwudhu lantas kembali lagi untuk melanjutkan khutubah. Maka khutubahnya tidak batal, tetap sah sampai akhir.\n\nDalilnya ketika Nabi Saw. sedang berkutubah, tiba-tiba beliau melihat dua cucunya (Hasan dan Husein) berkelahi berdebat kain merah. Lantas Nabi Saw. turun dari mimbar, membawa kedua cucunya itu pulang ke ibunya (fatimah), setelah itu beliau melanjutkan kembali ke mimbar dan melanjutkan kutubahnya."
          ]
      },
      {
          "tag":"makmum",
          "patterns":[
              "bagaimana ketika kita bermakmum dengan imam yang bacaannya tidak tepat",
              "apa hukumnya ketika kita bermakmum dengan imam yang mahraj dan tajwidnya tidak pas",
              "apa hukumnya ketika kita bermakmum dengan imam yang sering lupa dengan hafalannya"
          ],
          "responses":[
              "Musyawarah, ganti imam yang baru. Jadikan syarat-syarat imam yang sudah disepakati para ulama sebagai acuan dalam memilih imam baru. Ada 14 syarat yang paling utama adalah ulil amri atau pemimpin wilayah tersebut. kalau tidak bisa, di gantikan imam ratib atau imam tetap. kalau imam tetap kurang layak, di ganti orang paling tepat bacaannya dan paling paham al-Qur'an sebagai imam. kalau masih sulit menentukan karena syaratnya tidak masuk, diurutkan terus sampai ke 14. Apa syaratnya ke-14? Yaitu sudah menikah, ini syarat terakhiri"
          ]
      },
      {
          "tag":"solat-cepat",
          "patterns":[
              "Ada jamaah makmum yang membaca bacaan shalat agar keras sampai mengganggu jamaah di sebelahnya.bagaimana itu ustadz",
              "Bagaimana ketika kita solat ada jaamah makmum yang membaca bacaan sholat dengan keras sehingga makmum lainnya terganggu",
              "Apa hukumnya ketika ada makmum yang membaca bacaan sholat dengan keras pada sholat berjamaah"
          ],
          "responses":[
              "Makmum itu membacanya hamzah,maksudnya hanya didengar oleh dirinya sendiri.Mulut memang bergerak-gerak tapi tidak bersuara"
          ]
      },
      {
          "tag":"shaf_sholat",
          "patterns":[
              "Bagaimana caranya memberi tahu teman jamaah yang salah dalam shalatnya,yakni tidak mau merapatkan shaf,bahkan memisah jauh dari shaf",
              "Apa yang harus kita lakukan ketika teman disebelah kita tidak mau merapatkan shaf pada saat sholat berjamaah",
              "Ada teman yang tidak mau merapatkan shaf pada sholat jamaah,bagaimana cara memberi tau nya agar mau merapatkan shaf"
          ],
          "responses":[
              "Buatlah forum kajian,misalnya setelah magrib sampai isya,khusus membicarakan tentang shalat.Lalu jelaskan tentang masalah tersebut sampai tuntas"
          ]
      },
      {
          "tag":"Berpakaian_dalam_sholat",
          "patterns":[
              "Ada jamaah sholat yang memakai baju pendek,sehingga ketika sujud pinggangnya terbuka.Bagaimana itu",
              "Apakah sholat kita sah apabila kita memakai baju pendek dan terbuka pada saat sujud",
              "Apa hukumnya memakai baju pendek dan pada saat sujud kelihatan punggung pada saat sholat"
          ],
          "responses":[
              "Kalau shalat tapi auratnya kelihatan maka shalatnya batal dan harus diulang.Namanya shalat i'adah atau shalat ulang karena batal"
          ]
      },
      {
          "tag":"Mengucap_salam",
          "patterns":[
              "Mengucap salam sambil membalikkan telapak tangan.Apakah ada dalilnya",
              "Pada saat mengucap salam setelah shalat,apakah kita harus membalikkan telapak tangan,atau sebaliknya",
              "Apakah tiap pendapat tentang mazhab membuka telapak tangan saat mengucap salam berbeda-beda?"
          ],
          "responses":[
              "4 mazhab(syafi'i,Hanafi,Maliki,Hanbali)dan Albani memiliki pendapat sendiri-sendiri.Tapi masalah membalikkan telapak tangan,mazhab-mazhab tersebut tidak membalikkan telapak tangan"
          ]
      },
      {
          "tag":"azan",
          "patterns":[
              "Bolehkah azan 2 kali sebelum shalat jumat",
              "Bagaimana,apabila melakukan azan 2 kali sebelum shalat jumat",
              "Apakah hukum mengumandangkan azan 2 kali sebelum shalat jumat"
          ],
          "responses":[
              "Azan 1 kali dalah sunnah pada masa nabi saw,azan 2 kali adalah sunnah pada masa khulafa'ur Rasyidin.Kalau madzab syafi'i azannya 2 kali"
          ]
      },
      {
          "tag":"istri",
          "patterns":[
              "Bolehkan saya membawa istri shalat jumat,saya tempatkan di shaf laki-laki",
              "Apakah boleh ketika solat jumat saya membawa istri saya dan meletakkannya di shaf laki-laki",
              "Ketika saya dan istri saya di perjalan jauh dan waktu solat jumat telah masuk,apakah boleh saya membawa istri saya sholat jumat,dimana seharusnya di tempatkan "
          ],
          "responses":[
              "Silahkan,tapi jangan ditempatkan di shaf laki-laki.Shaf wanita ada dibelakang shaf laki-laki"
          ]
      },
      {
          "tag":"dzikir_malam",
          "patterns":[
              "Bagaimana hukumnya dzikir sepanjang malam tapi shalat subuhnya malah kesiangan",
              "Ada teman saya yang selalu melakukan dzikir malam tapi dia selalu kesiangan pada saat melakukan sholat subuh,itu gimana uztad",
              "Apa pendapat uztad ketika ada orang yang selalu dzikir malam tetapi solat subuhnya kesiangan terus"
          ],
          "responses":[
              "Itu namanya kurang pas dan tidak tepat"
          ]
      },
      {
          "tag":"berwudhu",
          "patterns":[
              "Ustadz,jika sedang shalat kentut,apakah harus berwudhu lagi",
              "Apabila kita sedang shalat dan kelepasan kentut yang tidak berbunyi,apakah wudhu batal",
              "Kentut pada saat telah berwudhu berbunyi maupun tidak berbunyi apakah wudhu kita batal,dan harus berwudhu lagi"
          ],
          "responses":[
              "Ya,harus.Entah kentutnya berbunyi atau tidak,itu sudah batal.Harus berwudhu lagi"
          ]
      },
      {
          "tag":"arah_kiblat",
          "patterns":[
              "Bagaimana shalat dimesjid yang arah kiblatnya tidak mengikuti penetapan yang dibuat oleh tim penetapan kemetrian agama",
              "Ada mesjid yang arah kiblatnya tidak mengikuti penetapan yang dibuat oleh tim penetapan kementrian agama,itu bagaimana uztad",
              "Apakah ada pendapat lain tentang kiblat mesjid"
          ],
          "responses":[
              "Masalah ini ikhtilaf.Ada dua pendapat.Pertama,asal sudah mengarah ke kiblat ya sudah,tidak apa-apa.Kedua,harus diukur secara tepat dengan melibatkan tokoh agama dan tokoh masyarakat setempat dengan disaksikan oleh pihak kanwil kementrian agama.Bisa dipilih salah satunya"
          ]
      },
      {
          "tag":"arah_kiblat",
          "patterns":[
              "Saya pernah jadi makmum dimesjid yang menghadap lurus kebarat,tidak kearah kiblat.Saya pun ikut miring.Jamaah yang lain tidak ikut,mereka menghadap ke barat.Apakah shalat saya tidak sah"
          ],
          "responses":[
              "Ada hadis, \"imam diangkat untuk diu ikuti.\"\n\nعَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَلَا تَخْتَلِفُوا عَلَيْهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ\nArtinya:\nDari Nabi shallallahu 'alaihi wa sallam, bahwasanya beliau shallallahu 'alaihi wa sallam bersabda: \"Sesungguhnya imam hanya untuk diikuti, maka janganlah menyelisihnya. Apabila ia ruku maka ruku'lah. Dan bila ia mengatakan 'sami'allahu liman hamidah, maka katakaniah,Rabbana walakal hamdu. Apabila ia sujud, maka sujudlah. Dan bila ia shalat dengan duduk, maka shalatlah dengan duduk semuanya\" (Muttafaqun 'alaihi)\nKalau mendasarkan pada hadis ini maka makmum harus ikut imam. Kalau imam miring maka makmum harus miring semua. Kalau imam tidak miring, makmum harus tidak miring semua.   "
          ]
      },
      {
          "tag":"bertato",
          "patterns":[
              "Ustadz,bagaimana orang bertato shalat? apa di terima shalatnya",
              "Teman saya ada yang memakai tato tetapi dia melaksanakan shalat,itu bagaimana ustadz",
              "Apa hukum bagi orang yang bertato tapi tetap melaksanakan shalat"
          ],
          "responses":[
              "Tidak masalah.Kalau sudah terlanjur bertato ya shalat saja,dari pada tidak bertato tapi tidak shalat.Tapi alangkah baiknya tato itu dihilangkan.Dan bagi yang belum bertato,tak usahlah kalian bertato.Baca kitab Syarah Hadis Abdullah bin Masud,sabda Nabi SAW.,Allah melaknat tukang buat dan orang yang minta di tato"
          ]
      },
      {
          "tag":"membaca_basmalah",
          "patterns":[
              "Ustadz,kalau shalat tidak membaca basmalah dalam al-fatihah,shalatnya sah atau tidak",
              "Apakah membaca basmalah dalam hati shalat dikatakan sah",
              "Ada berapa hukum membaca basmalah dalam shalat"
          ],
          "responses":[
              "Membaca basmalah dalam al-fatihah saat shalat hukumnya ada tiga.Madzhab syafi'i menjaharkan basmalah,Hanafi dan Hambali basmalah-nya diucapkan lirih,hampir tanpa suara.Madzhab Maliki tidak menyuarakan basmalah sama sekali"
          ]
      },
      {
          "tag":"dzikir_dijalan",
          "patterns":[
              "Ustadz,demi mengejar waktu agar tidak ketinggalan mengikuti pengajian,saya shalat maghrib dijalan dan tidak sempat melakukan dzikir setelah shalat.Bagaimana itu",
              "Apakah kita boleh dzikir sambil jalan karna kita tidak sempat berdzikir setelah solat karna mengejar waktu",
              "Apakah ada hadist yang menjelaskan tentang dzikir"
          ],
          "responses":[
              "Dzikir sambil jalan saja. Allah berfirman dalam surat an-Nisa':103,\n\nفَاذْكُرُوا اللَّهُ قِيَامًا وَقُعُودًا وَعَلَى جُنُوبِكُمْ\n\n\"Berdzikirlah waktu berdiri, ketika duduk, dan di saat berba- ring\" (QS. an-Nisa'`: 103). \n tapi sebisa mungkin laksanakan shalat sunnah Ba'diyah, itu penting"
          ]
      },
      {
          "tag":"tarawih_2rakaat",
          "patterns":[
              "bagaimana shalat tarawih dengan 4 rakaat lalu salam",
              "bagaimana shalat tarawih dengan 2 rakaat lalu salam",
              "bagaimana dengan orang yang sudah terbiasa dengan shalat tarawih dengan 2 rakaat lalu salam dan dengan 4 rakaat lalu salam",
              "bagaimana dengan orang yang sudah terbiasa dengan shalat tarawih dengan 4 rakaat lalu salam dan dengan 2 rakaat lalu salam"
          ],
          "responses":[
              "Menurut Empat Madzhab:\nMadzhab Hanafi : itu terhitung dua rakaat.\nMadzhab Hambali: sah, tapi makruh.\n Madzhab Maliki: sah, tapi makruh karena meninggalkan sunnah tasyahud dan salam setiap dua rakaat.\n Madzhab Syafi'i : batal"
          ]
      },
      {
          "tag":"tarawih_20_rakaat",
          "patterns":[
              "berapa rakaat untuk shalat tarawih",
              "apakah Rasulullah saw. melaksanakan shalat tarawin 20 rakaat"
          ],
          "responses":[
              "عَنْ أَبي سَلَمَةَ بْن عَبْدِ الرَّحْمَنِ بْن عَوْفِ أَنَّهُ سَأَلَ عَائِشَةَ زَوْحَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : كَيْفَ كَانَتْ صَلَاةٌ رَسُوْلِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ ؟ فَقَالَتْ : مَا كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَزِيدُ في رَمَضَانَ وَلاَ غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً, يُصَلِّى اَرْبعَاً فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُوْلِهِنَّ, ثُمَّ يُصَلِّى اَرْبعَاً فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُوْلِهِنَّ، ثُمَّ يُصَلِّى ثَلاثاً فَقَالَتْ عَائِشَةُ : فَقُلْتُ : يَا رَسُوْلَ اللهِ أَتَنَامُ قَبْلَ أَنْ تُوْتِرَ ؟ فَقَالَ : يَا عَائِشَةُ إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي ( رَوَاهُ الْاِمَامُ مَالِكِ )\nArtinya:\n\"Dari Abu Salamah bin Abdurrahman bin 'Auf, bahwasanya la pernah bertanya kepada Aisyah istri Nabi saw bagaimanakah shalat malam yang biasa dilakukan oleh Nabi saw. di bulan Ramadhan? kata Aisyah: 'Baik di bulan Ramadhan ataupun diluarnya, maka Rasulullah saw. tidak pernah menambah lebih dari sebelas rakaat, beliau shalat empat rakaat tetapi jangan engkau bertanya bagaimana sempurnanya atau lamanya shalat beliau tersebut. Kemudian beliau shalat lagi empat rakaat, tetapi jangan engkau bertanya bagaimana sempurnanya atau lamanya shalat beliau tersebut. Setelah itu beliau melakukan shalat tiga rakaat. Maka saya ('Aisyah) mengatakan: wahai Rasulullah saw. apakah engkau hendak tidur sebelum melakukan shalat witir ? jawab beliau: wahai 'Aisyah sesungguhnya hanya kedua mataku saja yang tidur sedangkan hatiku tidak pernah tidur.\" (HR. Imam Malik)"
          ]
      },
      {
          "tag":"anak_kecil_shalat",
          "patterns":[
              "apakah boleh anak kecil shalat berjamaah di masjid",
              "apa hukumnya anak kecil shalat berjamaah di masjid",
              "dimana saf anak kecil jika ikut shalat berjamaah di masjid"
          ],
          "responses":[
              "BOLEH hukumnya anak kecil yang telah mumayyiz (dapat membedakan baik dan buruk) berada di tengah shaf jika anak tersebut telah dididik dan diajarkan memuliakan masjid, dengan syarat: aman dari kesia-siaan dan suci secara sem- purna.\nLEBIH UTAMA JIKA ANAK-ANAK KECIL ITU BERADA DI BELAKANG LAKI-LAKI DEWASA, kecuali jika perkumpulan mereka itu dikhawatirkan menyebabkan mereka banyak bermain dan ter- tawa sehingga mengganggu orang yang shalat, maka mereka wajib dipisah."
          ]
      },
      {
          "tag":"shalat_berjamaah",
          "patterns":[
              "jelaskan hal-hal yang berkaitan dengan hukum dan keutamaan shalat berjamaah di masjid",
              "tololng jelaskan hal-hal yang berkaitan dengan hukum dan keutamaan shalat berjamaah di masjid",
              "hal-hal apa saja yang berkaitan dengan hukum shalat berjamaah"
          ],
          "responses":[
              "Hukum shalat berjamaah menurut beberapa madzhab\nMADZHAB HANAFI DAN MALIKI: SUNNAH MU'AKKAD Dalilnya, sabda Rasulullah saw.:\n\"Shalat berjamaah itu lebih utama daripada shalat sendirian 27 derajat.\" (HR. al-Bukhari) Ini menunjukkan bahwa shalat berjamaah itu termasuk jenis anjuran, seakan-akan Rasulullah saw. mengatakan, Shalat berjamaah lebih sempurna daripada shalat sendirian.\""
          ]
      },
      {
          "tag":"berdoa_bahasa_indonesia",
          "patterns":[
              "apa hukumnya berdoa dengan bahasa indonesia dalam shalt",
              "apakah bole berdoa dengan bahasa indonesia dalam shalat",
              "apa hukumnya mengucapkan doa berbahsa indonesia dalam shalat"
          ],
          "responses":[
              "Imam an-Nawawi berkata:15 \"Tidak boleh membuat-buat doa yang tidak ma'tsur (bukan dari al-Qur'an dan sunnah), kemudian diucapkan dalam bahasa asing (bukan Arab). Tidak ada perbedaan pendapat dalam masalah ini, shalat menjadi batal disebabkan itu.\""
          ]
      },
      {
          "tag":"shalat_berdahak",
          "patterns":[
              "bagaimana caranya membuang dahak ketika shalat",
              "apakah bole membuang dahak ketika shalat",
              "apakah ada dalil yang mengatakan boleh jika kita membuang dahak ketika shalat"
          ],
          "responses":[
              "Siapkan tisu di kantong. Saat berdahak - misalnya sedang flu - maka ambil tisu itu untuk tempat dahak. Lalu masukkan lagi ke dalam kantong baju.\n Kalau sedang shalat apa boleh bergerak?  Boleh saja, kalau memang darurat.\n | Mana dalilnya?  Ada. \"Bunuhlah dua yang hitam (ular dan kalajengking) ketika kau sedang shalat.\""
          ]
      },
      {
          "tag":"shalat_tasbih",
          "patterns":[
              "apa dalil shalt tasbih",
              "apa hukum shalat tasbih",
              "tolong berikan saya dalil tentang shalat tasbih",
              "tolong jelaskan dalil tentang shalat tasbih"
          ],
          "responses":[
              "DALIL PELAKSANAAN shalat sunnah Tasbih berdasarkan sab da Rasulullah saw.\n Dari Ibnu Abbas, sesungguhnya Rasulullah saw. berkata ke- pada al-'Abbas bin Abdul Muththalib, \"Wahai 'Abbas, wahai paman, maukah engkau aku berikan sesuatu terhadapmu 10 perkara jika engkau mau melakukannya niscaya Allah mengampuni dosamu, dosa yang pertama dan yang ter- akhir, yang dahulu dan yang baru, yang tersilap dan sengaja, yang kecil dan yang besar, yang rahasia dan yang nyata.\nYaitu, engkau laksanakan shalat empat rakaat, engkau baca dalam setiap rakaat itu al-Fatihah dan surat. Ketika selesai membaca itu, ketika engkau tegak, engkau ucapkan: 'Subhanallah wal hamdulillah wa la ilaha illallah Allahu akbar (Maha Suci Allah, segala puji bagi Allah, tiada Tuhan selain Allah, Allah Mahabesar) sebanyak 15 kali.\n Kemudian engkau ruku, engkau ucapkan 10 tasbih. Kemu- dian engkau angkat kepalamu dari ruku, engkau ucapkan 10 kali. Kemudian engkau sujud, engkau ucapkan 10 kali. Kemudian engkau angkat kepalamu dari sujud, engkau ucapkan 10 kali. Kemudian engkau sujud (kedua), engkau ucapkan 10 kali. Kemudian engkau angkat kepalamu dari su- jud, engkau ucapkan 10 kali. Maka itulah 75 kali tasbih. Engkau lakukan itu sebanyak 4 rakaat. Jika engkau mampu melaksanakannya satu kali sehari, maka laksakanlah. Jika engkau tidak mampu, maka laksanakanlah seminggu sekali. Jika engkau tidak mampu, maka laksanakanlah satu bulan sekali. Jika engkau tidak mampu, maka laksanakanlah seta- hun sekali. Jika engkau tidak mampu, maka seumur hidup sekali.\""
          ]
      },
      {
          "tag":"dalil_shalat_sunnah",
          "patterns":[
              "apakah benar ada sebagian orang mengatakan dalil shalat sunnah Tasbih itu tidak kuat karena hadisnya dha'af",
              "tolong jelaskan apakah dalil shalat subbah itu benar",
              "apakah benar shalat sunah dalilnya dha'af"
          ],
          "responses":[
              "BEBERAPA ulama terkemuka memberikan jawaban tentang kualitas hadis mengenai shalat sunnah tasbih.\n \"Sesungguhnya hadis tentang shalat Tasbih tidak turun dari derajat hadis hasan, karena jalur periwayatannya banyak. demikian juga dengan sumber-sumber takhrijnya. Bebera- pa imam menyusun kitab khusus berkaitan dengan hadis- hadis shalat Tasbih dengan menggabungkan jalur-jalur pe- riwayatannya, sebagaimana yang dinukil oleh al-Hafizh Ibnu Hajar dalam jawaban beliau terhadap beberapa pertanyaan seputar hadis-hadis yang dituduh sebagai hadis palsu, te- rangkum dalam Kitab al-Mashabih karya Imam al-Baghawi Al-Hafizh Ibnu Hajar berkata dalam jawabannya tersebut: 'Para ulama telah meriwayatkan tentang hadis shalat Tasbih, di antaranya adalah Imam Abu Dawud dalam as-Sunan, at-Tirmidzi dalam al-Jami', Ibnu Khuzaimah dalam as-Shahih, akan tetapi beliau mengatakan bahwa kabar ini kuat! Al-Hakim dalam al-Mustadrak, ia berkata: 'Sanadnya sahih. Ad-Daraquthni menyusun satu kitab khusus tentang hadis shalat Tasbih dengan berbagai jalur periwayatannya. Demikian juga dengan imam al-Khathib. Al-Hafizh Abu Musa al-Madini menyusun satu kitab berjudul Tashih Sha- lat at-Tasbih. Al-Hafizh Ibnu Hajar menutup jawabannya dengan menyatakan: 'Sebenarnya hadis-hadis tentang shalat Tasbih sampai derajat hadis hasan karena jalur-jalur pe- riwayatannya yang banyak, yang menguatkan jalur riwayat yang pertama.\""
          ]
      },
      {
          "tag":"menghitung_shalat_tasbih",
          "patterns":[
              "bagaimana cara menghitung jumlah tasbih tersebut",
              "apakah ada cara untuk mengitung shalat tasbih",
              "jelaskan cara menghitung jumlah tasbih"
          ],
          "responses":[
              "Jumlah tasbih yang di tetapkan oleh syariat islam, cara menghitungnya hanya dengan jari jemari, maka ini termasuk hal yang dimaafkan, insya Allah"
          ]
      },
      {
          "tag":"bacaat_shalat_tasbih",
          "patterns":[
              "apa saja bacaan shalat tasbih",
              "apakah bacaan surat-surat tertentu dalam shalat tasbih",
              "apa saja bacaan surat-surat tertentu dalam shalat tasbih"
          ],
          "responses":[
              "Tidak terdapat riwayad yang menyebutkan bacaan bacaan surat tertentu di baca dalam shalat Tasbih. Riwayat-riwayattentang Shalat tasbih sebagian besarnya hanya menyebutkan al-Fatihah dan membaca surat, tanpa tertentu dan jumlah tertentu."
          ]
      },
      {
          "tag":"shalat_tasbih",
          "patterns":[
              "Apakah 4 rakaat shalat Tasbih itu dilaksanakan bersambung dengan satu kali salam? Atau setiap dua rakaat satu salam?",
              "Apakah boleh menyambung 4 rakaat shalat tasbih dengan satu kali salam",
              "Apakah boleh menyambung 2 rakaat shalat tasbih dengan satu kali salam"
          ],
          "responses":[
              "Zahir hadis-hadis tentang shalat Tasbih menyebutkan bahwa shalat Tasbih dengan satu salam, baik dilaksanakan di waktu siang maupun di waktu malam."
          ]
      },
      {
          "tag":"shalat_tasbih",
          "patterns":[
              "Shalat sunnah Tasbih dilaksanakan sendirian atau berjamaah?",
              "apakah boleh sunnah Tasbih dilaksanakan berjamaah?",
              "apa hukumnya sunnah Tasbih dilaksanakan berjamaah?"
          ],
          "responses":[
              "DILIHAT DARI KALIMAT yang digunakan Rasulullah saw. ke- pada al-'Abbas, \"Wahai 'Abbas, wahai Paman, maukah eng- kau, sudikah engkau aku berikan... \"Ini menunjukkan makna bahwa shalat tersebut dilaksanakan sendirian."
          ]
      },
      {
          "tag":"waktu-tasbih",
          "patterns":[
              "Kapan waktu pelaksanaan shalat sunnah Tasbih?",
              "apakah ada waktu waktu tertentu untuk melaksanakan shalat tasbih",
              "apakah ada ketentuan untuk shalat tasbih"
          ],
          "responses":[
              "Shalat sunnah Tasbih adalah jenis shalat sunnah mutlaq (ti- dak terikat waktu) yang dilaksanakan dengan cara khusus sebagaimana yang telah disebutkan di atas. Makruh dilaksa- nakan pada waktu-waktu terlarang melaksanakan shalat (se- telah'Ashar, setelah Subuh, dan menjelang zawal/tergelincir matahari), demikian menurut pendapat yang kuat."
          ]
      },
      {
          "tag":"keutamaan_tasbih",
          "patterns":[
              "Apa keutamaan melaksanakan shalat sunnah Tasbih?",
              "keutamaan melaksanakan shalat sunnah tasbih"
          ],
          "responses":[
              "Di awal hadis, Rasulullah saw. menyatakan, \"Wahai 'Abbas, wahai paman, maukah engkau aku berikan, sudikah eng- kau aku lakukan sesuatu terhadapmu 10 perkara jika engkau mau melakukannya, Allah mengampuni dosamu, yang pertama dan yang terakhir, yang dahulu dan yang baru, yang tersilap dan sengaja, yang kecil dan yang besar, yang rahasia dan yang nyata, 10 perkara.\""
          ]
      },
      {
          "tag":"",
          "patterns":[
              "bagaimana jika khatib tidak bisa melanjutkan khutbah, karena pingsan misalnya?",
              "bagaimana jika khatib tidak bisa melanjutkan khutbah, karena meninggal misalnya?",
              "apa hukumnya khatib tidak bisa melanjutkan khutbah, karena meninggal misalnya?",
              "apa hukumnya khatib tidak bisa melanjutkan khutbah, karena pingsan misalnya?"
          ],
          "responses":[
              "NAIKLAH KHATIB BARU. Ada 5 rukun khutbah. Pertama, bertahmid: alhamdulillah. Kedua, shalawat: wash-shalatu was-salamu 'ala rasulillah. Ketiga, ajakan untuk bertakwa: ya ayyuhal-ladzina amanut- taqullah. Keempat, berwasiat tentang ketakwaan: ushikum wa nafsi bitaqwallah. Kelima, mendoakan kaum muslim: Allahummaghfir lil muslimin wal muslimat. Dengan membaca kelima kalimat itu sudah memenuhi syarat sebuah khutbah. Pada khutbah pertama membaca kelima rukun tersebut, lalu duduk sebentar, lalu berdiri untuk khutbah kedua dengan membaca kelima rukun tersebut. Ini sekadar syarat minimal kalau tidak bisa yang lebih panjang."
          ]
      },
      {
          "tag":"",
          "patterns":[
              "bagaimanad engan seseorang sewaktu muda sering meninggalkan shalat karena kesibukan dan alasan lain. Bagaimana cara mengganti shalat yang saya tinggalkan itu?",
              "bagaimana cara mengganti shalat yang tertunda yang kita tinggalkan",
              "bagaimana cara melakukan ahalat qadha"
          ],
          "responses":[
              "DENGAN DI-QADHA' atau diganti, ini sudah disepakati oleh madzhab Syafi'i, Maliki, Hanafi, dan Hambali. Caranya? Dite- bak-tebak. Sejak kapan meninggalkan shalat? Lalu hitung dan gantilah shalat yang ditinggalkan itu.\nBagaimana cara melakukan shalat qadha`?\nKalau mau mengqadha shalat Zhuhur, lalukan setelah shalat Zhuhur. Mengqadha shalat Ashar lakukan setelah shalat Ashar.\nMemangnya boleh shalat lagi setelah shalat 'Ashar?\nKarena darurat, boleh. Yang nggak boleh itu melakukan shalat sunnah mutlaq, tak boleh dilakukan setelah Ashar atau setelah Subuh.\nAda nggak ulama yang tidak mewajibkan untuk meng-qadha`?\nADA, YAITU IBNU TAIMIYAH. Menurut beliau, tak perlu diqadha cukup istighfar saja"
          ]
      },
      {
          "tag":"dalil_qadha",
          "patterns":[
              "Apa dalil tentang shalat Qadha",
              "Apa hukumnya tentang shalat Qadha"
          ],
          "responses":[
              "عَنْ أَنَسِ بْنِ مَالِكِ عَنْ النَّبِيِّ قَالَ مَنْ نَسِيَ صَلاةٌ فَلْيُصَلِّ إِذَا ذَكَرَهَا لا كَفَّارَةَ لَهَا إِلَّا ذَلِكَ وَأَقِمْالصلاة لذكري\nArtinya:\n \"Dari Anas bin Malik dari Nabi saw. bersabda, 'Siapa yang ter- lupa shalat, maka lakukan shalat ketika ia ingat dan tidak ada tebusan kecuali melaksanakan shalat tersebut dan dirikanlah shalat untuk mengingat-Ku.\" (HR. Bukhari)\n\nABU NU'AIM dan Musa bin Ismail menceritakan kepada kami, mereka berdua berkata, Hammam menceritakan kepada kami, dari Qatadah, dari Anas, dari Rasulullah saw., beliau bersabda, \"Siapa yang terlupa melaksanakan shalat, maka hendaklah ia melaksanakannya apabila ia mengingatnya, tidak ada penebusnya selain itu. (Firman Allah swt. surat Thaha ayat 20), Dan dirikanlah shalat untuk mengingat Aku.\""
          ]
      },
      {
          "tag":"",
          "patterns":[
              "KETIKA MAU shalat jamaah di masjid, sebentar lagi iqamah, waktu hanya cukup untuk shalat sunnah dua rakaat, antara Tahiyatul Masjid dan Qabliyah, shalat apa yang harus saya da- hulukan?",
              "apa yang harus di lakukan ketika sebentar lagi iqamah apa yang harus di lakukan",
              "apa yang harus di lakukan ketika waktu hanya cukup untuk shalat sunah 2 rakaat antara Tahiyatul Masjid dan Qabliyah"
          ],
          "responses":[
              "Dalam kasus seperti ini disyariatkan agar melaksanakan shalat sunnah Rawatib (qabliyah), sudah tercakup di dalamnya shalat Tahyatul Masjid. Sama halnya jika seseorang masuk ke dalam masjid, ia dapati shalat wajib sedang dilaksanakan, maka ia langsung ikut menyertai shalat wajib bersama imam, tidak perlu lagi shalat Tahyatul Masjid, berdasarkan hadis, \"Apabila shalat wajib dilaksanakan, maka tidak ada shalat lain kecuali shalat wajib\". (HR. Muslim dalam Shahih-nya)"
          ]
      },
      {
          "tag":"membaca_qunut",
          "patterns":[
              "Apa hukum membaca qunut?",
              "Apa hukum membaca qunut ketika shalat subuh?",
              "Apa dalil membaca qunut ketika shalat subuh?"
          ],
          "responses":[
              "QUNUT SUBUH madzhab Syafi'i:18 Adapun qunut, maka dianjurkan pada i'tidal kedua dalam shalat Subuh berdasarkan riwayat Anas, ia berkata, \"Rasulullah saw.terus-menerus membaca doa qunut pada shalat Subuh hingga beliau wafat.\" Diriwayatkan oleh Imam Ahmad dan imam lainnya, Imam Ibnu ash-Shalah berkata, \"Banyak para al-hafizh (ahli hadis) yang menyatakan hadis ini adalah hadis sahih. Di antara me- reka adalah Imam al-Hakim, al-Baihaqi, dan al-Balkhi.\" Al-Bai- haqi berkata, \"Membaca doa qunut pada shalat Subuh ini berdasarkan tuntunan dari empat Khulafa' Rasyidin.\""
          ]
      },
      {
          "tag":"",
          "patterns":[
              "bagaimanakah sikap MAKMUM tidak meyakini adanya doa qunut Subuh, tapi ia berimam kepada imam yang mambaca doa qunut",
              "JIKA MAKMUM tidak meyakini adanya doa qunut Subuh, tapi ia berimam kepada imam yang mambaca doa qunut, ba- gaimanakah sikapnya?"
          ],
          "responses":[
              "JIKA SEORANG yang bertaklid itu bertaklid dalam suatu ma- salah yang menurutnya baik menurut agamanya atau pen- dapat itu kuat atau seperti itu, maka boleh berdasarkan kese- pakatan jumhur ulama muslimin, tidak diharamkan oleh Imam Hanafi, Maliki, Syafi'i, dan Hambali."
          ]
      },
      {
          "tag":"shalat_Qabliyah",
          "patterns":[
              "Bagaimana pelaksanaan shalat Qabliyah Subuh jika terlambat?",
              "apakah boleh shalat Qabliyah Subuh terlambat?"
          ],
          "responses":[
              "QADHA SUNNAH FAJAR (Qabliyah Subuh) setelah shalat Subuh hukumnya boleh menurut pendapat yang kuat (rajih). Tidak bertentangan dengan hadis larangan melaksanakan shalat setelah shalat Subuh, karena yang dilarang adalah shalat yang tidak ada sebabnya. Akan tetapi jika qadha sunnah Fajar tersebut ditunda pelaksanaannya hingga wak- tu Dhuha, tidak khawatir terlupa, atau sibuk, maka itu lebih baik.23"
          ]
      },
      {
          "tag":"shalat_Rawatib",
          "patterns":[
              "Apakah ada tuntunannya shalat Rawatib sebelum Maghrib?",
              "tuntunan shalat Rawatib sebelum Maghrib?"
          ],
          "responses":[
              "ADA BEBERAPA HADIS yang bersifat umum yang mengandung makna bahwa shalat sunnah dua rakaat Qabliyah Maghrib itu disyariatkan, juga ada beberapa hadis yang bersifat khu- sus yang menyatakan bahwa shalat sunnah dua rakaat Qa- bliyah Maghrib itu disyariatkan.\n\nقَالَ فِي الثَّالِثَةِ : لِمَنْصَلُّوا قَبْلَ صَلَاةِ الْمَغْرِبِشَاءَ ، كَرَاهِيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً\nArtinya:\"Shalatlah sebelum shalat Maghrib\" 3 kali dan pada yang ke- tiga, beliau mengatakan, \"Bagi yang mau.\" Karena beliau tidak suka kalau umatnya menjadikan itu sebagai suatu kebiasaan. (HR. Bukhari 1183)"
          ]
      },
      {
          "tag":"shalat_Qabliyah_Subuh",
          "patterns":[
              "Apa keutamaan shalat Qabliyah Subuh? Apa bedanya dengan shalat sunnah Fajar?",
              "apa perbedaan shalat Qabliyah subuh dengan shalat sunnah fajar"
          ],
          "responses":[
              "DARI AISYAH, Rasulullah saw. tidak pernah sangat kuat melaksanakan shalat sunnah melebihi dua rakaat Fajar (Qabliyah Subuh).\" (HR. al-Bukhari dan Muslim) \"Dua rakaat fajar (Qabliyah Subuh) lebih baik daripada dunia dan seisinya.\" (HR. Muslim)"
          ]
      },
      {
          "tag":"menggerakkan_jari",
          "patterns":[
              "Apa hukum menggerak-gerakkan telunjuk saat duduk tasyahud?",
              "Apakah boleh menggerak-gerakkan telunjuk saat duduk tasyahud?"
          ],
          "responses":[
              "عن ابن عمر رضي الله عنهما: أَنَّ رَسُولَ اللَّهِ صَلَّى الله عليه وسلم إِذَا قَعَدَ لِلتَّشَهُدِ وَضَعَ يَدَهُ الْيُسْرَى عَلَى رُكْبَتِهِ وَاليُمْنَى عَلَى اليُمْنِي, وَعَقَدَ ثَلَاثًا وَخَمْسِيْنَ وَأَشَارَ بِإِصْبِعِهِ السبابة - - رواه مسلم\nArtinya:\n\"Dari Ibnu Umar ra. bahwa Rasulullah saw. jika duduk untuk tasyahhud, beliau meletakkan tangan kirinya di atas lutut kirinya, dan tangan kanannya di atas lutut kanannya dan membentuk angka \"lima puluh tiga\", dan memberi isyarat (menunjuk) de- ngan jari telunjuknya.\" (HR Muslim)."
          ]
      },
      {
          "tag":"iftirasy_tawarruk",
          "patterns":[
              "Jika saya masbuk, ketika imam duduk tasyahud akhir, apakah saya duduk dengan cara iftirasy atau tawarruk?",
              "apa yang harus saya lakukan ketika saya masbuk, imam duduk tasyahud akhir, apakah saya duduk dengan cara iftirasy atau tawarruk"
          ],
          "responses":[
              "ADA TIGA PENDAPAT dalam madzhab Syafi'i tentang cara duduk bagi orang yang masbuk (terlambat) duduk bersama imam di akhir shalat imam:28\n\nPENDAPAT SAHIH yang tertulis secara teks dalam Kitab al-Umm (karya Imam Syafi'i), ini juga pendapat Abu Hamid, al- Bandaniji, al-Qadhi Abu Thayyib, dan al- Ghazali: orang yang masbuk itu duduk iftirasy (duduk tasyahud awal), karena orang yang masbuk itu tidak berada di akhir shalatnya.\n\nORANG YANG MASBUK itu duduk tawarruk (duduk tasyahud akhir) mengikuti cara duduk imamnya. Pendapat ini diriwa- yatkan Imam al-Haramain dan Imam ar- Rafi'i.\n\nJIKA DUDUK itu pada posisi tasyahud awal bagi si masbuk, maka si masbuk itu duduk iftirasy. Jika bukan pada posisi ta- syahud awal, maka si masbuk duduk tawarruk. Karena duduk si masbuk saat itu hanya sekadar duduk mengikuti imam, maka masbuk mengikuti imam dalam bentuk cara duduk imam, demikian diri- wayatkan Imam ar-Rafi'i."
          ]
      },
      {
          "tag":"mengqashar_shalat",
          "patterns":[
              "Berapa hari boleh mengqashar shalat?",
              "apakah ada ketentuan hari untuk mengqasar shalat",
              "apakah ada ketentuan hari untuk mengqasar shalat"
          ],
          "responses":[
              "TETAP BOLEH shalat Qashar hingga menjadi mukim, tidak boleh qashar shalat jika berniat mukim di suatu negeri sela- ma 15 hari lebih."
          ]
      },
      {
          "tag":"",
          "patterns":[
              "Berapa jarak boleh mengqashar shalat?",
              "Jika boleh berapa jarak mengqashar shalat?",
              "Berapa jarak mengqashar shalat?",
              "apakah ada jarak mengqashar shalat?"
          ],
          "responses":[
              "Diukur dengan ukuran sekarang lebih kurang 89 km, detailnya adalah 88,708 meter. Boleh tetap shalat Qashar meskipun dapat ditempuh dalam satu jam perjalanan, seperti musafir menggunakan pesawat, mobil, dan sejenisnya.30\nجَعَلَ رَسُولُ الله - صلى الله عليه وسلم- ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ لِلْمُسَافِرِ وَيَوْمًا وَلَيْلَةً لِلْمُقِيمِ (مسلم (276)\nArtinya:\n\"Rasulullah shallallahu 'alaihi wa sallam menjadikan tiga hari tiga malam sebagai jangka waktu mengusap khuf bagi musafir, sedangkan sehari semalam untuk mukim.\" (HR. Muslim no. 276)"
          ]
      },
      {
          "tag":"shalat_Tahajjud",
          "patterns":[
              "Apa hukumnya shalat Tahajjud berjamaah?"
          ],
          "responses":[
              "KAMI membaca permohonan penjelasan hukum shalat Ta hajjud berjamaah di masjid di sepuluh terakhir ramadhan. \"Menurut para ahli fikih, boleh hukumnya shalat sunnah - seperti Tahajjud, Tarawih, dan lain-lain - dilaksanakan ber jamaah atau sendiri-sendiri, karena Rasulullah saw.melaksa nakan kedua cara ini, meskipun untuk shalat sunnah selain Tarawih lebih afdhal shalat di rumah, karena Rasulullah saw. bersabda: 'Shalat seseorang di rumahnya lebih afdhal daripada shalat di masjidku (Masjid Nabawi), kecuali shalat wajib.\" (HR. Abu Dawud)"
          ]
      },
      {
          "tag":"Idul_Fitri",
          "patterns":[
              "jika hari raya Idul Fitri bertepatan dengan hari Jumat, apakah tetap ada kewajiban shalat Jumat?",
              "apakah masih tetap ada shalat jumad jika hari raya idul fitri bertepatan di hari jumad"
          ],
          "responses":[
              "Dalam Kitab Fiqh as-Sunnah karya Syaikh Sayyid Sabiq, juz: 1, halaman: 316 dijelaskan: Jika hari Jumat dan hari raya bertepatan jatuh pada hari yang sama, maka kewajiban melaksanakan shalat Jumat gugur dari orang yang telah melaksanakan shalat 'led. Dari Zaid bin Arqam, ia berkata, \"Rasulullah saw. melaksanakan shalat ('led), kemudian beliau memberikan keringanan untuk melaksanakan shalat Jumat. Beliau berkata, Siapa yang mau melaksanakan shalat Jumat, maka hendaklah ia melaksanakannya.\" Diriwayatkan oleh imam yang lima, dinyatakan sahih oleh Ibnu Khuzaimah dan al-Hakim."
          ]
      },
      {
          "tag": "daging_babi",
          "patterns": [
            "Apa hukum makan daging babi dalam Islam?",
            "Apakah boleh makan daging babi?",
            "Apakah daging babi halal dalam Islam?",
            "Apakah daging babi diizinkan untuk dikonsumsi dalam agama Islam?"
          ],
          "responses":[
             "Dalam Islam, makan daging babi dilarang dengan tegas. Al-Qur'an, Surat Al-Baqarah (2:173)"
          ]
        },
        {
          "tag": "zina",
          "patterns": [
            "Apakah zina termasuk dosa besar dalam Islam?",
            "Bagaimana pandangan Islam terhadap perbuatan zina?",
            "Apakah zina diharamkan dalam agama Islam?",
            "Apa hukuman bagi pelaku zina menurut Islam?"
          ],
          "responses": [
             "Dalam Islam, zina termasuk dosa besar dan diharamkan. Hukumannya bisa berupa cambuk atau rajam. Hadis Sahih Bukhari, Kitab Al-Hudud, Bab Al-Zina"
          ]
        },
        {
          "tag": "hijab",
          "patterns": [
            "Apakah wanita dalam Islam harus berhijab?",
            "Bagaimana aturan berhijab dalam agama Islam?",
            "Apakah berhijab wajib dalam Islam?",
            "Apa hukum wanita yang tidak mengenakan hijab dalam Islam?"
          ],
          "responses": [
             "Dalam Islam, wanita diperintahkan untuk memakai hijab sebagai kewajiban. Al-Qur'an, Surat An-Nur (24:31)"
          ]
        },
        {
          "tag": "shalat_5_waktu",
          "patterns": [
            "Apakah shalat lima waktu wajib dalam Islam?",
            "Bagaimana tata cara shalat lima waktu?",
            "Berapa jumlah rakaat dalam shalat lima waktu?",
            "Apakah shalat fardhu wajib dilakukan bagi umat Muslim?"
          ],
          "responses": [
             "Dalam Islam, shalat lima waktu (subuh, dzuhur, ashar, maghrib, isya) adalah wajib. Hadis Sahih Muslim, Kitab Al-Salat, Bab Wujub Al-Salat"
          ]
        },
        {
          "tag": "Riba",
          "patterns": [
            "Bagaimana pandangan Islam tentang riba?",
            "Apakah riba diharamkan dalam agama Islam?",
            "Apakah boleh menerima atau memberikan riba dalam Islam?",
            "Apa hukum riba menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, riba diharamkan dan termasuk dosa besar. Transaksi yang melibatkan riba tidak diperbolehkan. Al-Qur'an, Surat Al-Baqarah (2:275)"
      ]
        },
        {
          "tag": "puasa",
          "patterns": [
            "Apakah puasa wajib dalam agama Islam?",
            "Bagaimana tata cara puasa dalam Islam?",
            "Berapa bulan dalam setahun umat Islam berpuasa?",
            "Apakah boleh tidak berpuasa bagi umat Muslim?"
          ],
          "responses": [
             "Dalam Islam, puasa wajib dilakukan pada bulan Ramadan setiap tahunnya. Al-Qur'an, Surat Al-Baqarah (2:185)"
          ]
        },
        {
          "tag": "Judi",
          "patterns": [
            "Apakah perjudian diperbolehkan dalam agama Islam?",
            "Bagaimana pandangan Islam tentang perjudian?",
            "Apakah berjudi diharamkan dalam agama Islam?",
            "Apa hukum bermain judi menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, perjudian diharamkan karena dapat merusak kehidupan dan menjauhkan dari ketuhanan. Hadis Sahih Muslim, Kitab Al-Imarah, Bab Tahrim Al-Maisir"
          ]
        },
        {
          "tag": "mencuri",
          "patterns": [
            "Apakah hukum mencuri dalam agama Islam?",
            "Bagaimana pandangan Islam tentang pencurian?",
            "Apakah mencuri diharamkan dalam Islam?",
            "Apa hukum mencuri menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, mencuri diharamkan dan termasuk dosa besar. Mencuri merusak keadilan dan hak orang lain. Al-Qur'an, Surat Al-Ma'idah (5:38)"
          ]
        },
        {
          "tag": "membunuh",
          "patterns": [
            "Apakah boleh membunuh dalam agama Islam?",
            "Bagaimana pandangan Islam tentang pembunuhan?",
            "Apakah membunuh diperbolehkan dalam Islam?",
            "Apa hukum membunuh menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, membunuh dilarang kecuali dalam kondisi tertentu seperti membela diri atau melaksanakan hukuman. Al-Qur'an, Surat Al-Isra' (17:33)"
          ]
        },
        {
          "tag": "alkohol",
          "patterns": [
           "Apakah boleh minum alkohol dalam agama Islam?",
            "Bagaimana pandangan Islam tentang minuman beralkohol?",
            "Apakah minum alkohol diharamkan dalam Islam?",
            "Apa hukum minum minuman keras menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, minum alkohol diharamkan karena dapat merusak kesehatan dan akal. Al-Qur'an, Surat Al-Ma'idah (5:90)"
          ]
        },
        {
          "tag": "zakat",
          "patterns": [
            "Bagaimana pandangan Islam tentang zakat?",
            "Apakah zakat wajib dalam agama Islam?",
            "Apa itu zakat dalam Islam?",
            "Berapa persen zakat yang harus dikeluarkan dalam Islam?"
          ],
          "responses": [
             "Dalam Islam, zakat merupakan kewajiban bagi umat Muslim yang mampu. Besarannya sekitar 2,5% dari harta yang mencapai nisab (batas minimum). Al-Qur'an, Surat Al-Baqarah (2:177)"
          ]
        },
        {
          "tag": "menikah_nonmuslim",
          "patterns": [
            "Apakah boleh menikah dengan orang non-Muslim dalam Islam?",
            "Bagaimana pandangan Islam tentang perkawinan beda agama?",
            "Apakah menikah dengan non-Muslim diizinkan dalam Islam?",
            "Apa hukum menikah dengan non-Muslim menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, seorang Muslim diperbolehkan menikah dengan seorang Muslimah saja. Al-Qur'an, Surat Al-Baqarah (2:221)"
          ]
        },
        {
          "tag": "mencabut_alis",
          "patterns": [
            "Apakah hukum mencabut alis dalam Islam?",
            "Bagaimana pandangan Islam tentang mencabut alis?",
            "Apakah mencabut alis diharamkan dalam agama Islam?",
            "Apa hukum mencabut alis menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, mencabut alis dilarang kecuali dalam kasus keperluan medis atau jika alis terlalu lebat dan menyebabkan gangguan. Hadis Sahih Muslim, Kitab Al-Libas, Bab Maa Yuharrimu Minal Libas"
          ]
        },
        {
          "tag": "memakan_hewan_halal",
          "patterns": [
            "Apakah boleh memakan hewan halal yang disembelih oleh non-Muslim?",
            "Bagaimana pandangan Islam tentang hewan halal yang disembelih oleh non-Muslim?",
            "Apakah boleh makan daging yang disembelih oleh non-Muslim dalam Islam?",
            "Apa hukum memakan daging yang tidak disembelih oleh Muslim menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, hewan halal harus disembelih oleh Muslim yang menyebut nama Allah pada saat menyembelih. Daging yang disembelih oleh non-Muslim yang tidak menyebut nama Allah dilarang untuk dikonsumsi. Al-Qur'an, Surat Al-Ma'idah (5:5)"
          ]
        },
        {
          "tag": "perbudakan",
          "patterns": [
            "Bagaimana pandangan Islam tentang perbudakan?",
            "Apakah perbudakan diperbolehkan dalam agama Islam?",
            "Apakah Islam mengizinkan praktik perbudakan?",
            "Apa hukum perbudakan menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, perbudakan tidak dianjurkan dan langkah-langkah diberikan untuk menghapus praktik perbudakan secara bertahap. Hadis Sahih Muslim, Kitab Al-Hudud, Bab Fi Al-Ummahat"
          ]
        },
        {
          "tag": "nerhala",
          "patterns": [
            "Apakah boleh menyembah atau berdoa kepada makhluk selain Allah dalam agama Islam?",
            "Bagaimana pandangan Islam tentang penyembahan berhala?",
            "Apakah menyembah berhala diizinkan dalam Islam?",
            "Apa hukum berdoa kepada selain Allah menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, menyembah berhala atau makhluk selain Allah adalah dosa besar. Umat Muslim diwajibkan menyembah dan berdoa hanya kepada Allah. Al-Qur'an, Surat Al-Anbiya' (21:66)"
          ]
        },
        {
          "tag": "mencium_lawan-Jenis",
          "patterns": [
            "Apakah boleh mencium atau berpelukan dengan lawan jenis sebelum menikah dalam Islam?",
            "Bagaimana pandangan Islam tentang ciuman dan pelukan sebelum menikah?",
            "Apakah ciuman atau pelukan diizinkan dalam agama Islam sebelum menikah?",
            "Apa hukum mencium atau berpelukan sebelum menikah menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, mencium atau berpelukan dengan lawan jenis sebelum menikah tidak diperbolehkan. Hadis Sahih Muslim, Kitab Al-Libas, Bab Maa Yuharrimu Minal Libas"
          ]
        },
        {
          "tag": "hukum_mati",
          "patterns": [
            "Bagaimana pandangan Islam tentang hukuman mati?",
            "Apakah hukuman mati diizinkan dalam agama Islam?",
            "Apakah Islam membenarkan hukuman mati?",
            "Apa hukum hukuman mati menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, hukuman mati diberlakukan dalam kasus-kasus tertentu seperti pembunuhan berencana, penghianatan, dan perbuatan serius lainnya. Hadis Sahih Muslim, Kitab Al-Hudud, Bab Al-Qisas"
          ]
        },
        {
          "tag": "mencukur_jenggot",
          "patterns": [
            "Apakah boleh mencukur jenggot dalam agama Islam?",
            "Bagaimana pandangan Islam tentang mencukur jenggot?",
            "Apakah mencukur jenggot diharamkan dalam Islam?",
            "Apa hukum mencukur jenggot menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, mencukur jenggot dilarang kecuali memotong atau merapikan jenggot. Hadis Sahih Muslim, Kitab Al-Libas, Bab Fi Al-Jaza' Fi Al-Haqiqah"
          ]
        },
        {
          "tag": "berbohong",
          "patterns": [
            "Apakah boleh berbohong dalam agama Islam?",
            "Bagaimana pandangan Islam tentang kebohongan?",
            "Apakah boleh berdusta dalam Islam?",
            "Apa hukum berbohong menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, berbohong atau berdusta dilarang karena termasuk perbuatan yang sangat tercela. Hadis Sahih Muslim, Kitab Al-Iman, Bab Tahrim Al-Kadhib"
          ]
        },
        {
          "tag": "homo_seksual",
          "patterns": [
            "Bagaimana pandangan Islam tentang homoseksualitas?",
            "Apakah homoseksualitas diperbolehkan dalam agama Islam?",
            "Apakah Islam mengizinkan hubungan sesama jenis?",
            "Apa hukum homoseksualitas menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, hubungan sesama jenis dianggap sebagai perbuatan yang terlarang dan dilarang. Al-Qur'an, Surat Al-A'raf (7:80-81)"
          ]
        },
        {
          "tag": "mengadopsi_anak",
          "patterns": [
            "Apakah boleh mengadopsi anak dalam agama Islam?",
            "Bagaimana pandangan Islam tentang adopsi?",
            "Apakah adopsi diizinkan dalam Islam?",
            "Apa hukum mengadopsi anak menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, mengadopsi anak diperbolehkan asalkan ada kejelasan dan keadilan dalam hak dan kewajiban. Hadis Sahih Muslim, Kitab Al-Adab, Bab Al-Muwalaah"
          ]
        },
        {
          "tag": "berpuasa_dalamperjalanan",
          "patterns": [
            "Apakah boleh berpuasa saat sedang dalam perjalanan?",
            "Bagaimana pandangan Islam tentang puasa saat bepergian?",
            "Apakah boleh berpuasa saat sedang dalam perjalanan?",
            "Apa hukum berpuasa saat dalam perjalanan menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, diperbolehkan bagi musafir (orang yang sedang bepergian) untuk tidak berpuasa dan menggantinya di lain waktu. Hadis Sahih Bukhari, Kitab Al-Sawm, Bab Al-Tayammum"
          ]
        },
        {
          "tag": "poligami",
          "patterns": [
            "Bagaimana pandangan Islam tentang pernikahan poligami?",
            "Apakah poligami diizinkan dalam agama Islam?",
            "Apakah Islam mengizinkan poligami?",
            "Apa hukum poligami menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, poligami diizinkan dengan syarat-syarat tertentu, seperti keadilan dalam memperlakukan istri-istri. Al-Qur'an, Surat Al-Nisa' (4:3)"
          ]
        },
        {
          "tag": "menikah_sepupu",
          "patterns": [
            "Apakah boleh menikah dengan sepupu dalam agama Islam?",
            "Bagaimana pandangan Islam tentang pernikahan dengan sepupu?",
            "Apakah menikah dengan sepupu diizinkan dalam Islam?",
            "Apa hukum menikah dengan sepupu menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, menikah dengan sepupu diperbolehkan asalkan tidak melanggar larangan pernikahan dalam keluarga terdekat. Hadis Sahih Muslim, Kitab Al-Nikah, Bab Al-Tahrim Ma Fi An-Nahwi Minal Hilali Wa Al-Nahwi"
          ]
        },
        {
          "tag": "alkohol",
          "patterns": [
            "Bagaimana pandangan Islam tentang minuman keras?",
            "Apakah minuman keras diperbolehkan dalam agama Islam?",
            "Apakah Islam mengizinkan konsumsi minuman keras?",
            "Apa hukum minuman keras menurut agama Islam?"
          ],
          "responses": [
             "Dalam Islam, minuman keras dilarang dan dianggap sebagai perbuatan yang terlarang. Al-Qur'an, Surat Al-Ma'idah (5:90)"
          ]
        
      }
      
  ]
}